doc/monparsing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Monadic Parser Combinators</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Monadic Parser Combinators"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-01T12:59-0700"/>
<meta name="author" content="Drew Crampsie"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Monadic Parser Combinators</h1>

<p>Graham Hutton <i>University of Nottingham</i> 
Erik Meijer <i>University of Utrecht</i> 
</p>
<p>
Appears as technical report NOTTCS-TR-96-4,
Department of Computer Science, University of Nottingham, 1996
</p>
<p>
Abstract:
</p>
<p>
In functional programming, a popular approach to building recursive
descent parsers is to model parsers as functions, and to define
higher-order functions (or combinators) that implement grammar
constructions such as sequencing, choice, and repetition. Such parsers
form an instance of a monad , an algebraic structure from mathematics
that has proved useful for addressing a number of computational
problems. The purpose of this article is to provide a step-by-step
tutorial on the monadic approach to building functional parsers, and
to explain some of the benefits that result from exploiting monads. No
prior knowledge of parser combinators or of monads is assumed. Indeed,
this article can also be viewed as a first introduction to the use of
monads in programming.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Combinator parsers</a>
<ul>
<li><a href="#sec-2-1">2.1 The type of parsers</a></li>
<li><a href="#sec-2-2">2.2 Primitive parsers</a></li>
<li><a href="#sec-2-3">2.3 Parser combinators</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Parsers and monads</a>
<ul>
<li><a href="#sec-3-1">3.1 The parser monad</a></li>
<li><a href="#sec-3-2">3.2 Monad comprehension syntax</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Combinators for repetition</a>
<ul>
<li><a href="#sec-4-1">4.1 Simple repetition</a></li>
<li><a href="#sec-4-2">4.2 Repetition with separators</a></li>
<li><a href="#sec-4-3">4.3 Repetition with meaningful separators</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Efficiency of parsers</a>
<ul>
<li><a href="#sec-5-1">5.1 Left factoring</a></li>
<li><a href="#sec-5-2">5.2 Improving laziness</a></li>
<li><a href="#sec-5-3">5.3 Limiting the number of results</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Handling lexical issues</a>
<ul>
<li><a href="#sec-6-1">6.1 White-space, comments, and keywords</a></li>
<li><a href="#sec-6-2">6.2 A parser for λ-expressions</a></li>
<li><a href="#sec-6-3">6.3 Factorising the parser monad</a></li>
</ul>
</li>
<li><a href="#sec-7">7 Common Lisp APPENDix</a>
<ul>
<li><a href="#sec-7-1">7.1 DEFINE-INTERFACE</a></li>
<li><a href="#sec-7-2">7.2 Pure Interface</a></li>
<li><a href="#sec-7-3">7.3 Pure Monad</a></li>
<li><a href="#sec-7-4">7.4 Pure Smug</a>
<ul>
<li><a href="#sec-7-4-1">7.4.1 Pure Smug dotted package</a></li>
</ul>
</li>
<li><a href="#sec-7-5">7.5 Test Lisp parser</a></li>
<li><a href="#sec-7-6">7.6 Test Monadic Parser</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
In functional programming, a popular approach to building recursive
descent parsers is to model parsers as functions, and to define
higher-order functions (or combinators) that implement grammar
constructions such as sequencing, choice, and repetition. The basic
idea dates back to at least Burge’s book on recursive programming
techniques (Burge, 1975), and has been popularised in functional
programming by Wadler (1985), Hutton (1992), Fokker (1995), and
others. Combinators provide a quick and easy method of building
functional parsers. Moreover, the method has the advantage over
functional parser generators such as Ratatosk (Mogensen, 1993) and
Happy (Gill &amp; Marlow, 1995) that one has the full power of a
functional language available to define new combinators for special
applications (Landin, 1966).
</p>
<p>
It was realised early on (Wadler, 1990) that parsers form an instance
of a monad , an algebraic structure from mathematics that has proved
useful for addressing a number of computational problems (Moggi, 1989;
Wadler, 1990; Wadler, 1992a; Wadler, 1992b). As well as being
interesting from a mathematical point of view, recognising the monadic
nature of parsers also brings practical benefits. For example, using a
monadic sequencing combinator for parsers avoids the messy
manipulation of nested tuples of results present in earlier
work. Moreover, using monad comprehension notation makes parsers more
compact and easier to read.
</p>
<p>
Taking the monadic approach further, the monad of parsers can be expressed in
a modular way in terms of two simpler monads. The immediate benefit is that the
basic parser combinators no longer need to be defined explicitly. Rather, they arise
automatically as a special case of lifting monad operations from a base monad m
to a certain other monad parameterised over m. This also means that, if we change
the nature of parsers by modifying the base monad (for example, limiting parsers
to producing at most one result), then new combinators for the modified monad of
parsers also arise automatically via the lifting construction.
</p>
<p>
The purpose of this article is to provide a step-by-step tutorial on
the monadic approach to building functional parsers, and to explain
some of the benefits that result from exploiting monads. Much of the
material is already known. Our contributions are the organisation of
the material into a tutorial article; the introduction of new
combinators for handling lexical issues without a separate lexer; and
a new approach to implementing the offside rule, inspired by the use of
monads.  Some prior exposure to functional programming would be
helpful in reading this article, but special features of Gofer (Jones,
1995b) — our implementation language — are explained as they are
used. Any other lazy functional language that supports
(multi-parameter) constructor classes and the use of monad
comprehension notation would do equally well. No prior knowledge of
parser combinators or monads is assumed. Indeed, this article can also
be viewed as a first introduction to the use of monads in
programming. A library of monadic parser combinators taken from this
article is available from the authors, via the World-Wide-Web.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Combinator parsers</h2>
<div class="outline-text-2" id="text-2">


<p>
We begin by reviewing the basic ideas of combinator parsing (Wadler, 1985; Hutton,
1992; Fokker, 1995). In particular, we define a type for parsers, three primitive
parsers, and two primitive combinators for building larger parsers.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The type of parsers</h3>
<div class="outline-text-3" id="text-2-1">


<p>
Let us start by thinking of a parser as a function that takes a string of characters as
input and yields some kind of tree as result, with the intention that the tree makes
explicit the grammatical structure of the string:
</p>



<pre class="example">type Parser = String -&gt; Tree
</pre>


<p>
In general, however, a parser might not consume all of its input string, so rather
than the result of a parser being just a tree, we also return the unconsumed suffix
of the input string. Thus we modify our type of parsers as follows:
</p>



<pre class="example">type Parser = String -&gt; (Tree,String)
</pre>


<p>
Similarly, a parser might fail on its input string. Rather than just reporting a
run-time error if this happens, we choose to have parsers return a list of pairs
rather than a single pair, with the convention that the empty list denotes failure of
a parser, and a singleton list denotes success:
</p>



<pre class="example">type Parser = String -&gt; [(Tree,String)]
</pre>


<p>
Having an explicit representation of failure and returning the unconsumed part
of the input string makes it possible to define combinators for building up parsers
piecewise from smaller parsers. Returning a list of results opens up the possibility
of returning more than one result if the input string can be parsed in more than
one way, which may be the case if the underlying grammar is ambiguous.
Finally, different parsers will likely return different kinds of trees, so it is useful
to abstract on the specific type Tree of trees, and make the type of result values
into a parameter of the Parser type:
</p>



<pre class="example">type Parser a = String -&gt; [(a,String)]
</pre>


<p>
This is the type of parsers we will use in the remainder of this article. One could
go further (as in (Hutton, 1992), for example) and abstract upon the type String
of tokens, but we do not have need for this generalisation here.
</p>
</div>

</div>
