doc/monparsing.org
** Primitive parsers

The three primitive parsers defined in this section are the building
blocks of combinator parsing. The first parser is result v, which
succeeds without consuming any of the input string, and returns the
single result v:

#+begin_src haskell
result :: a -> Parser a
result v = \inp -> [(v,inp)]
#+end_src

# <<lisp-result>>
#+name: lisp-result
#+begin_src lisp
    (defun result (value)
      (lambda (input) 
        (list (cons value input))))
#+end_src

#+name: test lisp result
#+begin_src lisp
  (assert (equal '((1 . "asd"))
                 (funcall (result 1) "asd")))
#+end_src

An expression of the form *\x -> e* is called a λ-abstraction, and
denotes the function that takes an argument x and returns the value of
the expression e. Thus result v is the function that takes an input
string inp and returns the singleton list [(v,inp)]. This function
could equally well be defined by result v inp = [(v,inp)], but we
prefer the above definition (in which the argument inp is shunted to
the body of the definition) because it corresponds more closely to the
type result :: a -> Parser a, which asserts that result is a function
that takes a single argument and returns a parser.

Dually, the parser zero always fails, regardless of the input string:

#+begin_src haskell
zero :: Parser a
zero = \inp -> []
#+end_src

#+name: lisp-zero 
#+begin_src lisp 
  (defun zero ()
   (constantly NIL))
#+end_src

#+name: test lisp zero 
#+begin_src lisp
(assert (eq NIL (funcall (zero) "asd")))
#+end_src

Our final primitive is item, which successfully consumes the first character if the
input string is non-empty, and fails otherwise:

#+begin_src haskell
item :: Parser Char
item = \inp -> case inp of
                [] -> []
                (x:xs) -> [(x,xs)]
#+end_src

#+name: lisp-item
#+begin_src lisp
  (defun item ()
    (lambda (input)
      (etypecase input 
        (null nil)
        (string
         (unless (equal input "")
           (list (cons (aref input 0)
                       (subseq input 1))))))))
#+end_src

#+name: test lisp item
#+begin_src lisp
  (assert (equal '((#\a . "sd"))
                 (funcall (item) "asd")))
  
  (assert (equal '((#\a . ""))
                 (funcall (item) "a")))
  
  (assert (null
           (funcall (item) "")))
#+end_src

