doc/monparsing.html

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Primitive parsers</h3>
<div class="outline-text-3" id="text-2-2">


<p>
The three primitive parsers defined in this section are the building
blocks of combinator parsing. The first parser is result v, which
succeeds without consuming any of the input string, and returns the
single result v:
</p>



<pre class="example">result :: a -&gt; Parser a
result v = \inp -&gt; [(v,inp)]
</pre>



<pre class="example">(defun result (value)
  (lambda (input) 
    (list (cons value input))))
</pre>



<pre class="example">(assert (equal '((1 . "asd"))
               (funcall (result 1) "asd")))
</pre>


<p>
An expression of the form <b>\x -&gt; e</b> is called a λ-abstraction, and
denotes the function that takes an argument x and returns the value of
the expression e. Thus result v is the function that takes an input
string inp and returns the singleton list [(v,inp)]. This function
could equally well be defined by result v inp = [(v,inp)], but we
prefer the above definition (in which the argument inp is shunted to
the body of the definition) because it corresponds more closely to the
type result :: a -&gt; Parser a, which asserts that result is a function
that takes a single argument and returns a parser.
</p>
<p>
Dually, the parser zero always fails, regardless of the input string:
</p>



<pre class="example">zero :: Parser a
zero = \inp -&gt; []
</pre>



<pre class="example">(defun zero ()
 (constantly NIL))
</pre>



<pre class="example">(assert (eq NIL (funcall (zero) "asd")))
</pre>


<p>
Our final primitive is item, which successfully consumes the first character if the
input string is non-empty, and fails otherwise:
</p>



<pre class="example">item :: Parser Char
item = \inp -&gt; case inp of
                [] -&gt; []
                (x:xs) -&gt; [(x,xs)]
</pre>



<pre class="example">(defun item ()
  (lambda (input)
    (etypecase input 
      (null nil)
      (string
       (unless (equal input "")
         (list (cons (aref input 0)
                     (subseq input 1))))))))
</pre>



<pre class="example">(assert (equal '((#\a . "sd"))
               (funcall (item) "asd")))

(assert (equal '((#\a . ""))
               (funcall (item) "a")))

(assert (null
         (funcall (item) "")))
</pre>


</div>

</div>
