doc/monparsing.org
** Parser combinators

The primitive parsers defined above are not very useful in
themselves. In this section we consider how they can be glued together
to form more useful parsers. We take our lead from the BNF notation
for specifying grammars, in which larger grammars are built up
piecewise from smaller grammars using a sequencing operator — denoted
by juxtaposition — and a choice operator — denoted by a vertical
bar |.

We define corresponding operators for combining parsers, such that the
structure of our parsers closely follows the structure of the
underlying grammars.

In earlier (non-monadic) accounts of combinator parsing (Wadler, 1985; Hutton,
1992; Fokker, 1995), sequencing of parsers was usually captured by a combinator


#+begin_src haskell
  seq     :: Parser a -> Parser b -> Parser (a,b)
  p ‘seq‘ q = \inp -> [((v,w),inp’’) | (v,inp’) <- p inp
                                     , (w,inp’’) <- q inp’]
#+end_src

#+name: lisp by itself sequence 
#+begin_src lisp  
  (defun sequence (parser1 parser2)
    (lambda (input)
      (loop :for (result-1 . input-1) 
         :in (funcall parser1 input)
         :append 
         (loop :for (result-2 . input-2)
            :in (funcall parser2 input-1)
            :collect 
            (cons 
             (cons result-1 result-2)
             input-2)))))          
#+end_src

#+name: test lisp sequence
#+begin_src lisp 
  (assert 
   (equal '(((#\a . #\s) . "d"))
          (funcall (sequence (item) (item)) "asd")))
#+end_src
  
that applies one parser after another, with the results from the two
parsers being combined as pairs. The infix notation p ‘seq‘ q is
syntactic sugar for seq p q; any function of two arguments can used as
an infix operator in this way, by enclosing its name in backquotes. At
first sight, the seq combinator might seem a natural composition
primitive. In practice, however, using seq leads to parsers with
nested tuples as results, which are messy to manipulate.

The problem of nested tuples can be avoided by adopting a monadic sequencing
combinator (commonly known as bind) which integrates the sequencing of parsers
with the processing of their result values:

#+begin_src haskell
  bind :: Parser a -> (a -> Parser b) -> Parser b
  p ‘bind‘ f = \inp -> concat [f v inp’ | (v,inp’) <- p inp]
#+end_src

#+name: lisp-bind
#+begin_src lisp
  (defun bind (parser function)
    (lambda (input)
      (loop :for (value . input) 
         :in (funcall parser input)
         :append (funcall (funcall function value) input))))
#+end_src

The definition for bind can be interpreted as follows. First of all,
the parser p is applied to the input string, yielding a list of
(value,string) pairs. Now since f is a function that takes a value and
returns a parser, it can be applied to each value (and unconsumed
input string) in turn. This results in a list of lists of
(value,string) pairs, that can then be flattened to a single list using
concat.

The bind combinator avoids the problem of nested tuples of results
because the results of the first parser are made directly available
for processing by the second, rather than being paired up with the
other results to be processed later on. A typical parser built using
bind has the following structure

#+begin_src haskell
  p1 ‘bind‘ \x1 ->
  p2 ‘bind‘ \x2 ->
  ...
  pn ‘bind‘ \xn ->
  result (f x1 x2 ... xn)
#+end_src

#+HTML: <br/>

#+NAME: lisp test bind
#+begin_src lisp
  (bind 
   p1 
   (lambda (x1)
     (bind 
      p2 
      (lambda (x2) 
        #| ... |#
        (bind 
         pn
         (lambda (xn)
           (result (f  x1 x2 #|...|# xn))))))))
  
#+end_src

and can be read operationally as follows: apply parser p1 and call its
result value x1; then apply parser p2 and call its result value x2;
. . .; then apply the parser pn and call its result value xn; and
finally, combine all the results into a single value by applying the
function f. For example, the seq combinator can be defined by

#+begin_src haskell
p ‘seq‘ q = p ‘bind‘ \x ->
q ‘bind‘ \y ->
result (x,y)
#+end_src

#+name: lisp sequence
#+begin_src lisp
  (defun sequence (parser-1 parser-2)
    (bind parser-1 
          (lambda (x)
       (bind parser-2 
             (lambda (y) 
               (result (cons x y)))))))
#+end_src

(On the other hand, bind cannot be defined in terms of seq.)

#+name: test lisp test bind
#+begin_src lisp
  (let* ((p1 (item))
         (p2 (result 'yay!))
         (pn (sequence 
              (item) (result 'two-much-yay!))))
    (assert (equal '(((#\A YAY! 
                       (#\S . TWO-MUCH-YAY!)) 
                      . "D"))
                   (funcall (|lisp test bind|
                             p1 p2 pn) "ASD"))))  
#+end_src

Using the bind combinator, we are now able to define some simple but useful
parsers. Recall that the item parser consumes a single character unconditionally. In
practice, we are normally only interested in consuming certain specific characters.
For this reason, we use item to define a combinator sat that takes a predicate (a
Boolean valued function), and yields a parser that consumes a single character if it
satisfies the predicate, and fails otherwise:

#+begin_src haskell
sat :: (Char -> Bool) -> Parser Char
sat p = item ‘bind‘ \x ->
if p x then result x else zero
#+end_src

#+name: lisp satisfies
#+begin_src lisp
  (defun satisfies (predicate)
    (bind (item) 
          (lambda (x)
            (if (funcall predicate x)
                (result x)
                (zero)))))
#+end_src

Note that if item fails (that is, if the input string is empty), then so does sat p,
since it can readily be observed that zero ‘bind‘ f = zero for all functions f of
the appropriate type. Indeed, this equation is not specific to parsers: it holds for
an arbitrary monad with a zero (Wadler, 1992a; Wadler, 1992b). Monads and their
connection to parsers will be discussed in the next section.

Using sat, we can define parsers for specific characters, single digits, lower-case
letters, and upper-case letters:

#+begin_src haskell
  char :: Char -> Parser Char
  char x = sat (\y -> x == y)
  
  digit :: Parser Char
  digit = sat (\x -> ’0’ <= x && x <= ’9’)
  
  lower :: Parser Char
  lower = sat (\x -> ’a’ <= x && x <= ’z’)
  
  upper :: Parser Char
  upper = sat (\x -> ’A’ <= x && x <= ’Z’)
#+end_src

#+begin_quote

#+end_quote

#+name: lisp predicates for satisfies 
#+begin_src lisp
  
  (defun char (x)
   (satisfies (lambda (y) (char= x y))))
  
  (defun digit ()
    (satisfies (lambda (x) 
                 (and (char<= #\0 x)
                      (char>= #\9 x)))))
  
  (defun lower ()
    (satisfies (lambda (x) 
                 (and (char<= #\a x)
                      (char>= #\z x)))))
  
  (defun upper ()
    (satisfies (lambda (x) 
                 (and (char<= #\A x)
                      (char>= #\Z x)))))
  
#+end_src

For example, applying the parser *upper* to the input string
*\-"Hello"\-* succeeds with the single successful result
*[(’H’,"ello")]*, since the upper parser succeeds with *’H’* as the
result value and *\-"ello"\-* as the unconsumed suffix of the
input. On the other hand, applying the parser lower to the string
*\-"Hello"\-* fails with *[]* as the result, since *’H’* is not a lower-case
letter.

#+name: test lisp upper
#+begin_src lisp 
(assert (equal '((#\H . "ello"))
          (funcall (upper) "Hello")))

(assert (cl:null 
          (funcall (lower) "Hello")))
#+end_src

As another example of using bind, consider the parser that accepts two
lower-case letters in sequence, returning a string of length two:

#+begin_src haskell
lower ‘bind‘ \x ->
lower ‘bind‘ \y ->
result [x,y]
#+end_src

#+name: lisp test string of length two
#+begin_src lisp
  (bind 
   (lower) 
   (lambda (x) 
     (bind 
      (lower) 
      (lambda (y) 
        (result (coerce (list x y) 'string))))))    
#+end_src

Applying this parser to the string "abcd" succeeds with the result
*[("ab","cd")]*.  Applying the same parser to *\-"aBcd\-* fails with the
result *[]*, because even though the initial letter *’a’* can be
consumed by the first lower parser, the following letter *’B’* cannot be
consumed by the second lower parser.

#+name: test lisp test string of length two
#+begin_src lisp
  (assert (equal '(("ab" . "cd"))
                 (funcall (|lisp test string of length two|) 
                          "abcd"))) 
  (assert (cl:null (funcall (|lisp test string of length two|) 
                            "aBcd")))
#+end_src

Of course, the above parser for two letters in sequence can be generalised to a
parser for arbitrary strings of lower-case letters. Since the length of the string to
be parsed cannot be predicted in advance, such a parser will naturally be defined
recursively, using a choice operator to decide between parsing a single letter and
recursing, or parsing nothing further and terminating. A suitable choice combinator
for parsers, plus, is defined as follows:

#+begin_src haskell
plus :: Parser a -> Parser a -> Parser a
p ‘plus‘ q = \inp -> (p inp ++ q inp)
#+end_src

#+name: lisp plus
#+begin_src lisp 
(defun plus (parser qarser)
  (lambda (input) 
    (append (funcall parser input)
            (funcall qarser input))))
#+end_src

That is, both argument parsers p and q are applied to the same input string, and
their result lists are concatenated to form a single result list. Note that it is not
required that p and q accept disjoint sets of strings: if both parsers succeed on
the input string then more than one result value will be returned, reflecting the
different ways that the input string can be parsed.

As examples of using plus, some of our earlier parsers can now be combined to
give parsers for letters and alpha-numeric characters:

#+begin_src haskell
letter :: Parser Char
letter = lower ‘plus‘ upper

alphanum :: Parser Char
alphanum = letter ‘plus‘ digit
#+end_src

#+name: lisp letter alphanum
#+begin_src lisp
(defun letter () (plus (lower) (upper)))
(defun alphanum () (plus (letter) (digit)))
#+end_src

More interestingly, a parser for words (strings of letters) is defined
by

#+begin_src haskell
word :: Parser String
word = neWord ‘plus‘ result ""
where
neWord = letter ‘bind‘ \x ->
  word ‘bind‘ \xs ->
  result (x:xs)
#+end_src

#+name: lisp word
#+begin_src lisp
(defun word ()
  (flet ((ne-word ()
          (bind 
	  (letter) 
	  (lambda (x) 
	  (bind (word) (lambda (xs) (result (cons x xs))))))))
  (plus (ne-word) (result nil))))
#+end_src

That is, word either parses a non-empty word (a single letter followed by a word,
using a recursive call to word), in which case the two results are combined to form
a string, or parses nothing and returns the empty string.

For example, applying word to the input "Yes!" gives the result [("Yes","!"),
("Ye","s!"), ("Y","es!"), ("","Yes!")]. The first result, ("Yes","!"), is the
expected result: the string of letters "Yes" has been consumed, and the unconsumed
input is "!". In the subsequent results a decreasing number of letters are consumed.

#+name: test lisp word
#+begin_src lisp

(assert (equal (funcall (word) "Yes!")
                  '(((#\Y #\e #\s) . "!") 
                    ((#\Y #\e) . "s!") 
                    ((#\Y) . "es!")
                    (NIL . "Yes!"))))

#+end_src

This behaviour arises because the choice operator plus is non-deterministic: both
alternatives can be explored, even if the first alternative is successful. Thus, at each
application of letter, there is always the option to just finish parsing, even if there
are still letters left to be consumed from the start of the input.

