doc/monparsing.html

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Parser combinators</h3>
<div class="outline-text-3" id="text-2-3">


<p>
The primitive parsers defined above are not very useful in
themselves. In this section we consider how they can be glued together
to form more useful parsers. We take our lead from the BNF notation
for specifying grammars, in which larger grammars are built up
piecewise from smaller grammars using a sequencing operator — denoted
by juxtaposition — and a choice operator — denoted by a vertical
bar |.
</p>
<p>
We define corresponding operators for combining parsers, such that the
structure of our parsers closely follows the structure of the
underlying grammars.
</p>
<p>
In earlier (non-monadic) accounts of combinator parsing (Wadler, 1985; Hutton,
1992; Fokker, 1995), sequencing of parsers was usually captured by a combinator
</p>




<pre class="example">seq     :: Parser a -&gt; Parser b -&gt; Parser (a,b)
p ‘seq‘ q = \inp -&gt; [((v,w),inp’’) | (v,inp’) &lt;- p inp
                                   , (w,inp’’) &lt;- q inp’]
</pre>



<pre class="example">(defun sequence (parser1 parser2)
  (lambda (input)
    (loop :for (result-1 . input-1) 
       :in (funcall parser1 input)
       :append 
       (loop :for (result-2 . input-2)
          :in (funcall parser2 input-1)
          :collect 
          (cons 
           (cons result-1 result-2)
           input-2)))))          
</pre>



<pre class="example">(assert 
 (equal '(((#\a . #\s) . "d"))
        (funcall (sequence (item) (item)) "asd")))
</pre>


<p>  
that applies one parser after another, with the results from the two
parsers being combined as pairs. The infix notation p ‘seq‘ q is
syntactic sugar for seq p q; any function of two arguments can used as
an infix operator in this way, by enclosing its name in backquotes. At
first sight, the seq combinator might seem a natural composition
primitive. In practice, however, using seq leads to parsers with
nested tuples as results, which are messy to manipulate.
</p>
<p>
The problem of nested tuples can be avoided by adopting a monadic sequencing
combinator (commonly known as bind) which integrates the sequencing of parsers
with the processing of their result values:
</p>



<pre class="example">bind :: Parser a -&gt; (a -&gt; Parser b) -&gt; Parser b
p ‘bind‘ f = \inp -&gt; concat [f v inp’ | (v,inp’) &lt;- p inp]
</pre>



<pre class="example">(defun bind (parser function)
  (lambda (input)
    (loop :for (value . input) 
       :in (funcall parser input)
       :append (funcall (funcall function value) input))))
</pre>


<p>
The definition for bind can be interpreted as follows. First of all,
the parser p is applied to the input string, yielding a list of
(value,string) pairs. Now since f is a function that takes a value and
returns a parser, it can be applied to each value (and unconsumed
input string) in turn. This results in a list of lists of
(value,string) pairs, that can then be flattened to a single list using
concat.
</p>
<p>
The bind combinator avoids the problem of nested tuples of results
because the results of the first parser are made directly available
for processing by the second, rather than being paired up with the
other results to be processed later on. A typical parser built using
bind has the following structure
</p>



<pre class="example">p1 ‘bind‘ \x1 -&gt;
p2 ‘bind‘ \x2 -&gt;
...
pn ‘bind‘ \xn -&gt;
result (f x1 x2 ... xn)
</pre>




<br/>


<pre class="example">(bind 
 p1 
 (lambda (x1)
   (bind 
    p2 
    (lambda (x2) 
      #| ... |#
      (bind 
       pn
       (lambda (xn)
         (result (f  x1 x2 #|...|# xn))))))))

</pre>


<p>
and can be read operationally as follows: apply parser p1 and call its
result value x1; then apply parser p2 and call its result value x2;
. . .; then apply the parser pn and call its result value xn; and
finally, combine all the results into a single value by applying the
function f. For example, the seq combinator can be defined by
</p>



<pre class="example">p ‘seq‘ q = p ‘bind‘ \x -&gt;
q ‘bind‘ \y -&gt;
result (x,y)
</pre>



<pre class="example">(defun sequence (parser-1 parser-2)
  (bind parser-1 
        (lambda (x)
     (bind parser-2 
           (lambda (y) 
             (result (cons x y)))))))
</pre>


<p>
(On the other hand, bind cannot be defined in terms of seq.)
</p>



<pre class="example">(let* ((p1 (item))
       (p2 (result 'yay!))
       (pn (sequence 
            (item) (result 'two-much-yay!))))
  (assert (equal '(((#\A YAY! 
                     (#\S . TWO-MUCH-YAY!)) 
                    . "D"))
                 (funcall (|lisp test bind|
                           p1 p2 pn) "ASD"))))  
</pre>


<p>
Using the bind combinator, we are now able to define some simple but useful
parsers. Recall that the item parser consumes a single character unconditionally. In
practice, we are normally only interested in consuming certain specific characters.
For this reason, we use item to define a combinator sat that takes a predicate (a
Boolean valued function), and yields a parser that consumes a single character if it
satisfies the predicate, and fails otherwise:
</p>



<pre class="example">sat :: (Char -&gt; Bool) -&gt; Parser Char
sat p = item ‘bind‘ \x -&gt;
if p x then result x else zero
</pre>



<pre class="example">(defun satisfies (predicate)
  (bind (item) 
        (lambda (x)
          (if (funcall predicate x)
              (result x)
              (zero)))))
</pre>


<p>
Note that if item fails (that is, if the input string is empty), then so does sat p,
since it can readily be observed that zero ‘bind‘ f = zero for all functions f of
the appropriate type. Indeed, this equation is not specific to parsers: it holds for
an arbitrary monad with a zero (Wadler, 1992a; Wadler, 1992b). Monads and their
connection to parsers will be discussed in the next section.
</p>
<p>
Using sat, we can define parsers for specific characters, single digits, lower-case
letters, and upper-case letters:
</p>



<pre class="example">char :: Char -&gt; Parser Char
char x = sat (\y -&gt; x == y)

digit :: Parser Char
digit = sat (\x -&gt; ’0’ &lt;= x &amp;&amp; x &lt;= ’9’)

lower :: Parser Char
lower = sat (\x -&gt; ’a’ &lt;= x &amp;&amp; x &lt;= ’z’)

upper :: Parser Char
upper = sat (\x -&gt; ’A’ &lt;= x &amp;&amp; x &lt;= ’Z’)
</pre>


<blockquote>



</blockquote>





<pre class="example">
(defun char (x)
 (satisfies (lambda (y) (char= x y))))

(defun digit ()
  (satisfies (lambda (x) 
               (and (char&lt;= #\0 x)
                    (char&gt;= #\9 x)))))

(defun lower ()
  (satisfies (lambda (x) 
               (and (char&lt;= #\a x)
                    (char&gt;= #\z x)))))

(defun upper ()
  (satisfies (lambda (x) 
               (and (char&lt;= #\A x)
                    (char&gt;= #\Z x)))))

</pre>


<p>
For example, applying the parser <b>upper</b> to the input string
<b>&shy;"Hello"&shy;</b> succeeds with the single successful result
<b>[(’H’,"ello")]</b>, since the upper parser succeeds with <b>’H’</b> as the
result value and <b>&shy;"ello"&shy;</b> as the unconsumed suffix of the
input. On the other hand, applying the parser lower to the string
<b>&shy;"Hello"&shy;</b> fails with <b>[]</b> as the result, since <b>’H’</b> is not a lower-case
letter.
</p>



<pre class="example">(assert (equal '((#\H . "ello"))
          (funcall (upper) "Hello")))

(assert (cl:null 
          (funcall (lower) "Hello")))
</pre>


<p>
As another example of using bind, consider the parser that accepts two
lower-case letters in sequence, returning a string of length two:
</p>



<pre class="example">lower ‘bind‘ \x -&gt;
lower ‘bind‘ \y -&gt;
result [x,y]
</pre>



<pre class="example">(bind 
 (lower) 
 (lambda (x) 
   (bind 
    (lower) 
    (lambda (y) 
      (result (coerce (list x y) 'string))))))    
</pre>


<p>
Applying this parser to the string "abcd" succeeds with the result
<b>[("ab","cd")]</b>.  Applying the same parser to <b>&shy;"aBcd&shy;</b> fails with the
result <b>[]</b>, because even though the initial letter <b>’a’</b> can be
consumed by the first lower parser, the following letter <b>’B’</b> cannot be
consumed by the second lower parser.
</p>



<pre class="example">(assert (equal '(("ab" . "cd"))
               (funcall (|lisp test string of length two|) 
                        "abcd"))) 
(assert (cl:null (funcall (|lisp test string of length two|) 
                          "aBcd")))
</pre>


<p>
Of course, the above parser for two letters in sequence can be generalised to a
parser for arbitrary strings of lower-case letters. Since the length of the string to
be parsed cannot be predicted in advance, such a parser will naturally be defined
recursively, using a choice operator to decide between parsing a single letter and
recursing, or parsing nothing further and terminating. A suitable choice combinator
for parsers, plus, is defined as follows:
</p>



<pre class="example">plus :: Parser a -&gt; Parser a -&gt; Parser a
p ‘plus‘ q = \inp -&gt; (p inp ++ q inp)
</pre>



<pre class="example">(defun plus (parser qarser)
  (lambda (input) 
    (append (funcall parser input)
            (funcall qarser input))))
</pre>


<p>
That is, both argument parsers p and q are applied to the same input string, and
their result lists are concatenated to form a single result list. Note that it is not
required that p and q accept disjoint sets of strings: if both parsers succeed on
the input string then more than one result value will be returned, reflecting the
different ways that the input string can be parsed.
</p>
<p>
As examples of using plus, some of our earlier parsers can now be combined to
give parsers for letters and alpha-numeric characters:
</p>



<pre class="example">letter :: Parser Char
letter = lower ‘plus‘ upper

alphanum :: Parser Char
alphanum = letter ‘plus‘ digit
</pre>



<pre class="example">(defun letter () (plus (lower) (upper)))
(defun alphanum () (plus (letter) (digit)))
</pre>


<p>
More interestingly, a parser for words (strings of letters) is defined
by
</p>



<pre class="example">word :: Parser String
word = neWord ‘plus‘ result ""
where
neWord = letter ‘bind‘ \x -&gt;
  word ‘bind‘ \xs -&gt;
  result (x:xs)
</pre>



<pre class="example">(defun word ()
  (flet ((ne-word ()
          (bind 
          (letter) 
          (lambda (x) 
          (bind (word) (lambda (xs) (result (cons x xs))))))))
  (plus (ne-word) (result nil))))
</pre>


<p>
That is, word either parses a non-empty word (a single letter followed by a word,
using a recursive call to word), in which case the two results are combined to form
a string, or parses nothing and returns the empty string.
</p>
<p>
For example, applying word to the input "Yes!" gives the result [("Yes","!"),
("Ye","s!"), ("Y","es!"), ("","Yes!")]. The first result, ("Yes","!"), is the
expected result: the string of letters "Yes" has been consumed, and the unconsumed
input is "!". In the subsequent results a decreasing number of letters are consumed.
</p>



<pre class="example">
(assert (equal (funcall (word) "Yes!")
                  '(((#\Y #\e #\s) . "!") 
                    ((#\Y #\e) . "s!") 
                    ((#\Y) . "es!")
                    (NIL . "Yes!"))))

</pre>


<p>
This behaviour arises because the choice operator plus is non-deterministic: both
alternatives can be explored, even if the first alternative is successful. Thus, at each
application of letter, there is always the option to just finish parsing, even if there
are still letters left to be consumed from the start of the input.
</p>
</div>
</div>

</div>
