doc/monparsing.org
* Parsers and monads

Later on we will define a number of useful parser combinators in terms
of the primitive parsers and combinators just defined. But first we
turn our attention to the monadic nature of combinator parsers.

