doc/monparsing.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Parsers and monads</h2>
<div class="outline-text-2" id="text-3">


<p>
Later on we will define a number of useful parser combinators in terms
of the primitive parsers and combinators just defined. But first we
turn our attention to the monadic nature of combinator parsers.
</p>

</div>
