doc/monparsing.org
** The parser monad
So far, we have defined (among others) the following two operations on
parsers:

#+begin_src haskell
result :: a -> Parser a
bind :: Parser a -> (a -> Parser b) -> Parser b
#+end_src

#+begin_src lisp :noweb yes
<<lisp result>>

<<lisp bind>>
#+end_src

Generalising from the specific case of Parser to some arbitrary type
constructor M gives the notion of a monad: a monad is a type
constructor M (a function from types to types), together with
operations result and bind of the following types:

#+begin_src haskell
result :: a -> M a
bind :: M a -> (a -> M b) -> M b
#+end_src

#+name: lisp generic result bind
#+begin_src lisp
 (defgeneric result (<monad> value))
 (defgeneric bind (<monad> monadic-value monadic-function))
#+end_src

Thus, parsers form a monad for which M is the Parser type constructor,
and result and bind are defined as previously. Technically, the two
operations of a monad must also satisfy a few algebraic properties,
but we do not concern ourselves with such properties here; see
(Wadler, 1992a; Wadler, 1992b) for more details.

Readers familiar with the categorical definition of a monad may have
expected two operations *map :: (a -> b) -> (M a -> M b)* and *join ::
M (M a) -> M* a in place of the single operation bind. However, our
definition is equivalent to the categorical one (Wadler, 1992a;
Wadler, 1992b), and has the advantage that bind generally proves more
convenient for monadic programming than map and join.

Parsers are not the only example of a monad. Indeed, we will see later
on how the parser monad can be re-formulated in terms of two simpler
monads. This raises the question of what to do about the naming of the
monadic combinators result and bind. In functional languages based
upon the Hindley-Milner typing system (for example, Miranda1 and
Standard ML) it is not possible to use the same names for the
combinators of different monads. Rather, one would have to use
different names, such as resultM and bindM, for the combinators of
each monad M.

Gofer, however, extends the Hindley-Milner typing system with an
overloading mechanism that permits the use of the same names for the
combinators of different monads. Under this overloading mechanism, the
appropriate monad for each use of a name is calculated automatically
during type inference.  Overloading in Gofer is accomplished by the
use of classes (Jones, 1995c). A class for monads can be declared in
Gofer by: 

#+begin_src haskell
class Monad m where 
result :: a -> m a 
bind:: m a -> (a -> m b) -> m b
#+end_src 

#+name: lisp-monad-interface
#+begin_src lisp
  
  (define-interface <monad> (<interface>)
    ()
    (:generic result (<interface> value))
    (:generic bind (<interface> monadic-value monadic-function)))
  
#+end_src

This declaration can be read as follows: a type constructor m is a member of the
class Monad if it is equipped with result and bind operations of the specified types.
The fact that m must be a type constructor (rather than just a type) is inferred
from its use in the types for the operations.

#+begin_src lisp
  (macroexpand-1 
   '(define-interface <monad> (<interface>)
     ()
     (:generic result (<interface> value))
     (:generic bind (<interface> monadic-value monadic-function))))
  ;; => 
  (PROGN
   (DEFCLASS <MONAD> (<INTERFACE>) NIL)
   (DEFGENERIC RESULT
       (<INTERFACE> VALUE))
   (DEFGENERIC BIND
       (<INTERFACE> MONADIC-VALUE MONADIC-FUNCTION))
   (DEFMETHOD INTERFACE-OPTIONS APPEND ((<I> <MONAD>))
     '((:GENERIC RESULT (<INTERFACE> VALUE))
       (:GENERIC BIND (<INTERFACE> MONADIC-VALUE MONADIC-FUNCTION)))))
#+end_src

Now the type constructor Parser can be made into an instance of the
class Monad using the result and bind from the previous section:

#+begin_src haskell
instance Monad Parser where 
-- result :: a -> Parser a result v = \inp
-> [(v,inp)] -- bind
:: Parser a -> (a -> Parser b) -> Parser b
p ‘bind‘ f = \inp -> concat [f v out | (v,out) <- p inp]
#+end_src

#+begin_src lisp
  (define-interface <parser> (<monad>) 
    ()
    (:singleton))
#+end_src

#+begin_src lisp
  (macroexpand-1 
   '(define-interface <parser> (<monad>) 
     ()
     (:singleton)))
  ;; =>
  (PROGN
   (DEFCLASS <PARSER> (<MONAD>) NIL)
   (DEFVAR <PARSER> (MAKE-INSTANCE '<PARSER>))
   (DEFMETHOD INTERFACE-OPTIONS APPEND ((<I> <PARSER>)) '((:SINGLETON))))
  
#+end_src

#+name: lisp-parser-result and bind definition
#+begin_src lisp
  (defmethod result ((<p> <parser>) value)
    (lambda (input) (list (cons value input))))
  
  (defmethod bind ((<p> <parser>) parser function)
    (lambda (input)
      (loop :for (value . input) 
         :in (funcall parser input)
         :append (funcall (funcall function value) input))))
#+end_src


We pause briefly here to address a couple of technical points
concerning Gofer.  First of all, type synonyms such as Parser must be
supplied with all their arguments. Hence the instance declaration
above is not actually valid Gofer code, since Parser is used in the
first line without an argument. The problem is easy to solve (redefine
Parser using data rather than type, or as a restricted type synonym),
but for simplicity we prefer in this article just to assume that type
synonyms can be partially applied. The second point is that the syntax
of Gofer does not currently allow the types of the defined functions
in instance declarations to be explicitly specified. But for clarity,
as above, we include such types in comments.

Let us turn now to the following operations on parsers:

#+begin_src haskell
zero :: Parser a
plus :: Parser a -> Parser a -> Parser a
#+end_src


Generalising once again from the specific case of the Parser type constructor, we
arrive at the notion of a monad with a zero and a plus, which can be encapsulated
using the Gofer class system in the following manner:

#+begin_src haskell
class Monad m => Monad0Plus m where
zero :: m a
(++) :: m a -> m a -> m a
#+end_src

#+name: lisp-zero-plus-interface
#+begin_src lisp
  (define-interface <zero-plus> (<interface>)
    ()
    (:generic zero (<interface>))
    (:generic plus (<interface> 
                    interface-value-1
                    interface-value-2)))
  
  (define-interface <monad-zero-plus> (<monad> <zero-plus>)
      ()
      (:generic guard (<interface> 
                       predicate value
                       &rest predicate-args)))
  
#+end_src

That is, a type constructor m is a member of the class Monad0Plus if
it is a member of the class Monad (that is, it is equipped with a
result and bind), and if it is also equipped with zero and (++)
operators of the specified types. Of course, the two extra operations
must also satisfy some algebraic properties; these are discussed in
(Wadler, 1992a; Wadler, 1992b). Note also that (++) is used above
rather than plus, following the example of lists: we will see later on
that lists form a monad for which the plus operation is just the
familiar append operation (++).

Now since Parser is already a monad, it can be made into a monad with a zero
and a plus using the following definitions:

#+begin_src haskell
  instance Monad0Plus Parser where
  -- zero :: Parser a
  zero
  = \inp -> []
  -- (++) :: Parser a -> Parser a -> Parser a
  p ++ q
  = \inp -> (p inp ++ q inp)
#+end_src

#+name: lisp-parser-interface
#+begin_src lisp
  (define-interface <parser> (<monad-zero-plus>) 
    ()
    (:singleton)
    (:generic item (<parser>))
    (:generic input (<parser>)))
  
  (defgeneric item-input (<parser> input)
    (:method ((<p> <parser>) (input cl:null))
      input)
    (:method ((<p> <parser>) (input cl:string))
      (unless (cl:string= input "")
        (list 
         (cons (aref input 0) 
               (multiple-value-bind (array displaced-index-offset) 
                   (array-displacement input) 
                 (let ((string (or array input))
                       (index (if array (1+ displaced-index-offset) 1)))
                   (make-array (1- (length input))
                               :displaced-to string
                               :displaced-index-offset index
                               :element-type (array-element-type string)))))))))
  
  (defmethod item ((<p> <parser>))
    (lambda (input)
      (item-input <p> input)))
  
  (defmethod input ((<p> <parser>))
    (lambda (input)
      (funcall (result <p> input) input)))
#+end_src

#+name: lisp-parser-zero/plus definition
#+begin_src lisp
  (defmethod zero ((<p> <parser>))
     (constantly NIL))
  
  (defmethod plus ((<p> <parser>) parser qarser)
    (lambda (input)
      (append (funcall parser input) (funcall qarser input))))
#+end_src

