doc/monparsing.html

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The parser monad</h3>
<div class="outline-text-3" id="text-3-1">

<p>So far, we have defined (among others) the following two operations on
parsers:
</p>



<pre class="example">result :: a -&gt; Parser a
bind :: Parser a -&gt; (a -&gt; Parser b) -&gt; Parser b
</pre>



<pre class="example">


</pre>


<p>
Generalising from the specific case of Parser to some arbitrary type
constructor M gives the notion of a monad: a monad is a type
constructor M (a function from types to types), together with
operations result and bind of the following types:
</p>



<pre class="example">result :: a -&gt; M a
bind :: M a -&gt; (a -&gt; M b) -&gt; M b
</pre>



<pre class="example">(defgeneric result (&lt;monad&gt; value))
(defgeneric bind (&lt;monad&gt; monadic-value monadic-function))
</pre>


<p>
Thus, parsers form a monad for which M is the Parser type constructor,
and result and bind are defined as previously. Technically, the two
operations of a monad must also satisfy a few algebraic properties,
but we do not concern ourselves with such properties here; see
(Wadler, 1992a; Wadler, 1992b) for more details.
</p>
<p>
Readers familiar with the categorical definition of a monad may have
expected two operations <b>map :: (a -&gt; b) -&gt; (M a -&gt; M b)</b> and <b>join :: M (M a) -&gt; M</b> a in place of the single operation bind. However, our
definition is equivalent to the categorical one (Wadler, 1992a;
Wadler, 1992b), and has the advantage that bind generally proves more
convenient for monadic programming than map and join.
</p>
<p>
Parsers are not the only example of a monad. Indeed, we will see later
on how the parser monad can be re-formulated in terms of two simpler
monads. This raises the question of what to do about the naming of the
monadic combinators result and bind. In functional languages based
upon the Hindley-Milner typing system (for example, Miranda1 and
Standard ML) it is not possible to use the same names for the
combinators of different monads. Rather, one would have to use
different names, such as resultM and bindM, for the combinators of
each monad M.
</p>
<p>
Gofer, however, extends the Hindley-Milner typing system with an
overloading mechanism that permits the use of the same names for the
combinators of different monads. Under this overloading mechanism, the
appropriate monad for each use of a name is calculated automatically
during type inference.  Overloading in Gofer is accomplished by the
use of classes (Jones, 1995c). A class for monads can be declared in
Gofer by: 
</p>



<pre class="example">class Monad m where 
result :: a -&gt; m a 
bind:: m a -&gt; (a -&gt; m b) -&gt; m b
</pre>



<pre class="example">
(define-interface &lt;monad&gt; (&lt;interface&gt;)
  ()
  (:generic result (&lt;interface&gt; value))
  (:generic bind (&lt;interface&gt; monadic-value monadic-function)))

</pre>


<p>
This declaration can be read as follows: a type constructor m is a member of the
class Monad if it is equipped with result and bind operations of the specified types.
The fact that m must be a type constructor (rather than just a type) is inferred
from its use in the types for the operations.
</p>



<pre class="example">(macroexpand-1 
 '(define-interface &lt;monad&gt; (&lt;interface&gt;)
   ()
   (:generic result (&lt;interface&gt; value))
   (:generic bind (&lt;interface&gt; monadic-value monadic-function))))
;; =&gt; 
(PROGN
 (DEFCLASS &lt;MONAD&gt; (&lt;INTERFACE&gt;) NIL)
 (DEFGENERIC RESULT
     (&lt;INTERFACE&gt; VALUE))
 (DEFGENERIC BIND
     (&lt;INTERFACE&gt; MONADIC-VALUE MONADIC-FUNCTION))
 (DEFMETHOD INTERFACE-OPTIONS APPEND ((&lt;I&gt; &lt;MONAD&gt;))
   '((:GENERIC RESULT (&lt;INTERFACE&gt; VALUE))
     (:GENERIC BIND (&lt;INTERFACE&gt; MONADIC-VALUE MONADIC-FUNCTION)))))
</pre>


<p>
Now the type constructor Parser can be made into an instance of the
class Monad using the result and bind from the previous section:
</p>



<pre class="example">instance Monad Parser where 
-- result :: a -&gt; Parser a result v = \inp
-&gt; [(v,inp)] -- bind
:: Parser a -&gt; (a -&gt; Parser b) -&gt; Parser b
p ‘bind‘ f = \inp -&gt; concat [f v out | (v,out) &lt;- p inp]
</pre>



<pre class="example">(define-interface &lt;parser&gt; (&lt;monad&gt;) 
  ()
  (:singleton))
</pre>



<pre class="example">(macroexpand-1 
 '(define-interface &lt;parser&gt; (&lt;monad&gt;) 
   ()
   (:singleton)))
;; =&gt;
(PROGN
 (DEFCLASS &lt;PARSER&gt; (&lt;MONAD&gt;) NIL)
 (DEFVAR &lt;PARSER&gt; (MAKE-INSTANCE '&lt;PARSER&gt;))
 (DEFMETHOD INTERFACE-OPTIONS APPEND ((&lt;I&gt; &lt;PARSER&gt;)) '((:SINGLETON))))

</pre>



<pre class="example">(defmethod result ((&lt;p&gt; &lt;parser&gt;) value)
  (lambda (input) (list (cons value input))))

(defmethod bind ((&lt;p&gt; &lt;parser&gt;) parser function)
  (lambda (input)
    (loop :for (value . input) 
       :in (funcall parser input)
       :append (funcall (funcall function value) input))))
</pre>



<p>
We pause briefly here to address a couple of technical points
concerning Gofer.  First of all, type synonyms such as Parser must be
supplied with all their arguments. Hence the instance declaration
above is not actually valid Gofer code, since Parser is used in the
first line without an argument. The problem is easy to solve (redefine
Parser using data rather than type, or as a restricted type synonym),
but for simplicity we prefer in this article just to assume that type
synonyms can be partially applied. The second point is that the syntax
of Gofer does not currently allow the types of the defined functions
in instance declarations to be explicitly specified. But for clarity,
as above, we include such types in comments.
</p>
<p>
Let us turn now to the following operations on parsers:
</p>



<pre class="example">zero :: Parser a
plus :: Parser a -&gt; Parser a -&gt; Parser a
</pre>



<p>
Generalising once again from the specific case of the Parser type constructor, we
arrive at the notion of a monad with a zero and a plus, which can be encapsulated
using the Gofer class system in the following manner:
</p>



<pre class="example">class Monad m =&gt; Monad0Plus m where
zero :: m a
(++) :: m a -&gt; m a -&gt; m a
</pre>



<pre class="example">(define-interface &lt;zero-plus&gt; (&lt;interface&gt;)
  ()
  (:generic zero (&lt;interface&gt;))
  (:generic plus (&lt;interface&gt; 
                  interface-value-1
                  interface-value-2)))

(define-interface &lt;monad-zero-plus&gt; (&lt;monad&gt; &lt;zero-plus&gt;)
    ()
    (:generic guard (&lt;interface&gt; 
                     predicate value
                     &amp;rest predicate-args)))

</pre>


<p>
That is, a type constructor m is a member of the class Monad0Plus if
it is a member of the class Monad (that is, it is equipped with a
result and bind), and if it is also equipped with zero and (++)
operators of the specified types. Of course, the two extra operations
must also satisfy some algebraic properties; these are discussed in
(Wadler, 1992a; Wadler, 1992b). Note also that (++) is used above
rather than plus, following the example of lists: we will see later on
that lists form a monad for which the plus operation is just the
familiar append operation (++).
</p>
<p>
Now since Parser is already a monad, it can be made into a monad with a zero
and a plus using the following definitions:
</p>



<pre class="example">instance Monad0Plus Parser where
-- zero :: Parser a
zero
= \inp -&gt; []
-- (++) :: Parser a -&gt; Parser a -&gt; Parser a
p ++ q
= \inp -&gt; (p inp ++ q inp)
</pre>



<pre class="example">(define-interface &lt;parser&gt; (&lt;monad-zero-plus&gt;) 
  ()
  (:singleton)
  (:generic item (&lt;parser&gt;)))

(defgeneric item-input (&lt;parser&gt; input)
  (:method ((&lt;p&gt; &lt;parser&gt;) (input cl:null))
    input)
  (:method ((&lt;p&gt; &lt;parser&gt;) (input cl:string))
    (unless (cl:string= input "")
      (list 
       (cons (aref input 0) 
             (multiple-value-bind (array displaced-index-offset) 
                 (array-displacement input) 
               (let ((string (or array input))
                     (index (if array (1+ displaced-index-offset) 1)))
                 (make-array (1- (length input))
                             :displaced-to string
                             :displaced-index-offset index
                             :element-type (array-element-type string)))))))))

(defmethod item ((&lt;p&gt; &lt;parser&gt;))
  (lambda (input)
    (item-input &lt;p&gt; input)))
</pre>



<pre class="example">(defmethod zero ((&lt;p&gt; &lt;parser&gt;))
   (constantly NIL))

(defmethod plus ((&lt;p&gt; &lt;parser&gt;) parser qarser)
  (lambda (input)
    (append (funcall parser input) (funcall qarser input))))
</pre>


</div>

</div>
