doc/monparsing.org
** Monad comprehension syntax

So far we have seen one advantage of recognising the monadic nature of
parsers: the monadic sequencing combinator bind handles result values
better than the conventional sequencing combinator seq. In this
section we consider another advantage of the monadic approach, namely
that monad comprehension syntax can be used to make parsers more
compact and easier to read.

As mentioned earlier, many parsers will have a structure as a sequence of binds
followed by single call to result:

#+begin_src haskell
p1 ‘bind‘
p2 ‘bind‘
...
pn ‘bind‘
result (f \x1 -> \x2 -> \xn ->
x1 x2 ... xn)
#+end_src


Gofer provides a special notation for defining parsers of this shape,
allowing them to be expressed in the following, more appealing form:

#+begin_src haskell
[ f x1 x2 ... xn | x1 <- p1
, x2 <- p2
, ...
, xn <- pn ]
#+end_src

#+name: lisp-mlet*
#+begin_src lisp 
    (defmacro mlet* (monad bindings &body body)
      (let ((interface-form (if (listp monad) monad (list monad))))    
        (destructuring-bind (monad-interface &rest args &key (with-interface t) &allow-other-keys)
            interface-form
          (if with-interface 
              `(with-interface (,monad-interface ,@args) 
                 (mlet* (,(cl:first interface-form)
                          :with-interface nil
                          ,@(rest interface-form))
                      ,bindings
                     ,@body))
              (if bindings 
                  (destructuring-bind ((var form) &rest rest-of-bindings)
                      bindings
                    `(funcall 
                      'bind ,monad-interface ,form 
                      (lambda (,var) 
                        ,@(when (cl:string= var "_")
                                `((declare (ignorable ,var))))
                        (mlet* ,interface-form ,rest-of-bindings
                          ,@body))))
                  `(cl:progn ,@body))))))
    
#+end_src

#+name: lisp macroexpand-all-mlet*-
#+begin_src lisp 
  (#.(first (apropos-list "macroexpand-all")) 
                                     '(mlet* <parser> ((a (plus (result 1) (item)))
                                                       (_ (guard #'numberp a))
                                                       (b (plus (item) (zero))))
                                       (result (cons a b))))
  ;; =>
  (LET ((#:G1462 <PARSER>))
    (FLET ((ITEM (&REST ARGS)
             (APPLY 'ITEM #:G1462 ARGS))
           (GUARD (&REST ARGS)
             (APPLY 'GUARD #:G1462 ARGS))
           (RESULT (&REST ARGS)
             (APPLY 'RESULT #:G1462 ARGS))
           (BIND (&REST ARGS)
             (APPLY 'BIND #:G1462 ARGS))
           (ZERO (&REST ARGS)
             (APPLY 'ZERO #:G1462 ARGS))
           (PLUS (&REST ARGS)
             (APPLY 'PLUS #:G1462 ARGS)))
      (BIND (PLUS (RESULT 1) (ITEM))
            (LAMBDA (A)
              (BIND (GUARD #'NUMBERP A)
                    (LAMBDA (_)
                      (DECLARE (IGNORABLE _))
                      (BIND (PLUS (ITEM) (ZERO))
                            (LAMBDA (B) (PROGN (RESULT (CONS A B)))))))))))
#+end_src

In fact, this notation is not specific to parsers, but can be used
with any monad (Jones, 1995c). The reader might notice the similarity
to the list comprehension notation supported by many functional
languages. It was Wadler (1990) who first observed that the
comprehension notation is not particular to lists, but makes sense for
an arbitrary monad. Indeed, the algebraic properties required of the
monad operations turn out to be precisely those required for the
notation to make sense. To our knowledge, Gofer is the first language
to implement Wadler’s monad comprehension notation. Using this
notation can make parsers much easier to read, and we will use the
notation in the remainder of this article.

As our first example of using comprehension notation, we define a
parser for recognising specific strings, with the string itself
returned as the result:

#+begin_src haskell
string :: String -> Parser String
string "" = [""]
string (x:xs) = [x:xs | _ <- char x, _ <- string xs]
#+end_src

#+name: lisp-parser-string 
#+begin_src lisp
(defun string (string)
   (if (cl:string= string "")
       (result <parser> nil)
       (mlet* <parser> 
         ((_ (char (aref string 0)))
          (_ (string (subseq string 1))))
        (result string))))
#+end_src

That is, if the string to be parsed is empty we just return the empty
string as the result; *[""]* is just monad comprehension syntax for
result "". Otherwise, we parse the first character of the string using
char, and then parse the remaining characters using a recursive call
to string. Without the aid of comprehension notation, the above
definition would read as follows:

#+begin_src haskell
string:: String -> Parser String
string "" = result ""
string (x:xs) = char x
‘bind‘ \_ ->
string xs ‘bind‘ \_ ->
result (x:xs)
#+end_src

#+begin_src lisp
  (defun string (string)
    (if (cl:string= string "")
        (result <parser> nil)
        (bind 
         <parser>
         (char (aref string 0))
         (lambda (_) 
           (declare (ignore _))
           (bind 
            <parser>
            (string (subseq string 1))
            (lambda (_) 
              (declare (ignore _))         
              (result <parser> string)))))))
  
#+end_src

Note that the parser string xs fails if only a prefix of the given
string xs is recognised in the input. For example, applying the parser
*\-string "hello"\-* to the input *\-"hello there"\-* gives the successful result
*[("hello"," there")]*. On the other hand, applying the same parser to
"helicopter" fails with the result [], even though the prefix "hel" of
the input can be recognised.

#+name: test lisp-parser-string
#+begin_src lisp
  (assert (equal '(("hello" . " there"))
                 (funcall (string "hello") 
                          "hello there")))
  
  (assert (cl:null (funcall (string "hello") 
                            "helicopter")))
#+end_src

In list comprehension notation, we are not just restricted to generators that bind
variables to values, but can also use Boolean-valued guards that restrict the values
of the bound variables. For example, a function negs that selects all the negative
numbers from a list of integers can be expressed as follows:

#+begin_src haskell
negs:: [Int] -> [Int]
negs xs = [x | x <- xs, x < 0]
#+end_src

#+name: lisp-monad-zero-plus-guard
#+begin_src lisp
  (defmethod guard ((<m> <monad-zero-plus>) 
                      predicate value
                      &rest predicate-args)
      (if (apply predicate value predicate-args)
          (result <m> value)
          (zero <m>)))
#+end_src

#+begin_src lisp
(defun negs (xs) 
  (mlet* <list> ((x xs))
    (guard #'< x 0)))
#+end_src

In this case, the expression x < 0 is a guard that restricts the
variable x (bound by the generator x <- xs) to only take on values
less than zero.

Wadler (1990) observed that the use of guards makes sense for an
arbitrary monad with a zero. The monad comprehension notation in Gofer
supports this use of guards. For example, the sat combinator

#+begin_src haskell
sat :: (Char -> Bool) -> Parser Char
sat p = item ‘bind‘ \x ->
if p x then result x else zero

#+end_src

can be defined more succinctly using a comprehension with a guard:

#+begin_src haskell
sat :: (Char -> Bool) -> Parser Char
sat p = [x | x <- item, p x]
#+end_src

#+name: lisp-parser-satisfies
#+begin_src lisp
  (defun satisfies (predicate &rest args)
    (mlet* <parser> ((x (item)))
      (apply #'guard predicate x args)))  
#+end_src

We conclude this section by noting that there is another notation that can be
used to make monadic programs easier to read: the so-called “do” notation (Jones,
1994; Jones & Launchbury, 1994). For example, using this notation the combinators
string and sat can be defined as follows:

#+begin_src haskell
string:: String -> Parser String
string "" = do { result "" }
string (x:xs) = do { char x ; string xs ; result (x:xs) }

sat :: (Char -> Bool) -> Parser Char
sat p = do { x <- item ; if (p x) ; result x }
#+end_src


The do notation has a couple of advantages over monad comprehension
notation: we are not restricted to monad expressions that end with a
use of result; and generators of the form <- e that do not bind
variables can be abbreviated by e.  The do notation is supported by
Gofer, but monad expressions involving parsers typically end with a
use of result (to compute the result value from the parser), so the
extra generality is not really necessary in this case. For this
reason, and for simplicity, in this article we only use the
comprehension notation. It would be an easy task, however, to
translate our definitions into the do notation.

