doc/monparsing.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Monad comprehension syntax</h3>
<div class="outline-text-3" id="text-3-2">


<p>
So far we have seen one advantage of recognising the monadic nature of
parsers: the monadic sequencing combinator bind handles result values
better than the conventional sequencing combinator seq. In this
section we consider another advantage of the monadic approach, namely
that monad comprehension syntax can be used to make parsers more
compact and easier to read.
</p>
<p>
As mentioned earlier, many parsers will have a structure as a sequence of binds
followed by single call to result:
</p>



<pre class="example">p1 ‘bind‘
p2 ‘bind‘
...
pn ‘bind‘
result (f \x1 -&gt; \x2 -&gt; \xn -&gt;
x1 x2 ... xn)
</pre>



<p>
Gofer provides a special notation for defining parsers of this shape,
allowing them to be expressed in the following, more appealing form:
</p>



<pre class="example">[ f x1 x2 ... xn | x1 &lt;- p1
, x2 &lt;- p2
, ...
, xn &lt;- pn ]
</pre>



<pre class="example">(defmacro mlet* (monad bindings &amp;body body)
  (let ((interface-form (if (listp monad) monad (list monad))))    
    (destructuring-bind (monad-interface &amp;rest args &amp;key (with-interface t) &amp;allow-other-keys)
        interface-form
      (if with-interface 
          `(with-interface (,monad-interface ,@args) 
             (mlet* (,(cl:first interface-form)
                      :with-interface nil
                      ,@(rest interface-form))
                  ,bindings
                 ,@body))
          (if bindings 
              (destructuring-bind ((var form) &amp;rest rest-of-bindings)
                  bindings
                `(funcall 
                  'bind ,monad-interface ,form 
                  (lambda (,var) 
                    ,@(when (cl:string= var "_")
                            `((declare (ignorable ,var))))
                    (mlet* ,interface-form ,rest-of-bindings
                      ,@body))))
              `(cl:progn ,@body))))))

</pre>



<pre class="example">(#.(first (apropos-list "macroexpand-all")) 
                                   '(mlet* &lt;parser&gt; ((a (plus (result 1) (item)))
                                                     (_ (guard #'numberp a))
                                                     (b (plus (item) (zero))))
                                     (result (cons a b))))
;; =&gt;
(LET ((#:G1462 &lt;PARSER&gt;))
  (FLET ((ITEM (&amp;REST ARGS)
           (APPLY 'ITEM #:G1462 ARGS))
         (GUARD (&amp;REST ARGS)
           (APPLY 'GUARD #:G1462 ARGS))
         (RESULT (&amp;REST ARGS)
           (APPLY 'RESULT #:G1462 ARGS))
         (BIND (&amp;REST ARGS)
           (APPLY 'BIND #:G1462 ARGS))
         (ZERO (&amp;REST ARGS)
           (APPLY 'ZERO #:G1462 ARGS))
         (PLUS (&amp;REST ARGS)
           (APPLY 'PLUS #:G1462 ARGS)))
    (BIND (PLUS (RESULT 1) (ITEM))
          (LAMBDA (A)
            (BIND (GUARD #'NUMBERP A)
                  (LAMBDA (_)
                    (DECLARE (IGNORABLE _))
                    (BIND (PLUS (ITEM) (ZERO))
                          (LAMBDA (B) (PROGN (RESULT (CONS A B)))))))))))
</pre>


<p>
In fact, this notation is not specific to parsers, but can be used
with any monad (Jones, 1995c). The reader might notice the similarity
to the list comprehension notation supported by many functional
languages. It was Wadler (1990) who first observed that the
comprehension notation is not particular to lists, but makes sense for
an arbitrary monad. Indeed, the algebraic properties required of the
monad operations turn out to be precisely those required for the
notation to make sense. To our knowledge, Gofer is the first language
to implement Wadler’s monad comprehension notation. Using this
notation can make parsers much easier to read, and we will use the
notation in the remainder of this article.
</p>
<p>
As our first example of using comprehension notation, we define a
parser for recognising specific strings, with the string itself
returned as the result:
</p>



<pre class="example">string :: String -&gt; Parser String
string "" = [""]
string (x:xs) = [x:xs | _ &lt;- char x, _ &lt;- string xs]
</pre>



<pre class="example">(defun string (string)
   (if (cl:string= string "")
       (result &lt;parser&gt; nil)
       (mlet* &lt;parser&gt; 
         ((_ (char (aref string 0)))
          (_ (string (subseq string 1))))
        (result string))))
</pre>


<p>
That is, if the string to be parsed is empty we just return the empty
string as the result; <b>[""]</b> is just monad comprehension syntax for
result "". Otherwise, we parse the first character of the string using
char, and then parse the remaining characters using a recursive call
to string. Without the aid of comprehension notation, the above
definition would read as follows:
</p>



<pre class="example">string:: String -&gt; Parser String
string "" = result ""
string (x:xs) = char x
‘bind‘ \_ -&gt;
string xs ‘bind‘ \_ -&gt;
result (x:xs)
</pre>



<pre class="example">(defun string (string)
  (if (cl:string= string "")
      (result &lt;parser&gt; nil)
      (bind 
       &lt;parser&gt;
       (char (aref string 0))
       (lambda (_) 
         (declare (ignore _))
         (bind 
          &lt;parser&gt;
          (string (subseq string 1))
          (lambda (_) 
            (declare (ignore _))         
            (result &lt;parser&gt; string)))))))

</pre>


<p>
Note that the parser string xs fails if only a prefix of the given
string xs is recognised in the input. For example, applying the parser
<b>&shy;string "hello"&shy;</b> to the input <b>&shy;"hello there"&shy;</b> gives the successful result
<b>[("hello"," there")]</b>. On the other hand, applying the same parser to
"helicopter" fails with the result [], even though the prefix "hel" of
the input can be recognised.
</p>



<pre class="example">(assert (equal '(("hello" . " there"))
               (funcall (string "hello") 
                        "hello there")))

(assert (cl:null (funcall (string "hello") 
                          "helicopter")))
</pre>


<p>
In list comprehension notation, we are not just restricted to generators that bind
variables to values, but can also use Boolean-valued guards that restrict the values
of the bound variables. For example, a function negs that selects all the negative
numbers from a list of integers can be expressed as follows:
</p>



<pre class="example">negs:: [Int] -&gt; [Int]
negs xs = [x | x &lt;- xs, x &lt; 0]
</pre>



<pre class="example">(defmethod guard ((&lt;m&gt; &lt;monad-zero-plus&gt;) 
                    predicate value
                    &amp;rest predicate-args)
    (if (apply predicate value predicate-args)
        (result &lt;m&gt; value)
        (zero &lt;m&gt;)))
</pre>



<pre class="example">(defun negs (xs) 
  (mlet* &lt;list&gt; ((x xs))
    (guard #'&lt; x 0)))
</pre>


<p>
In this case, the expression x &lt; 0 is a guard that restricts the
variable x (bound by the generator x &lt;- xs) to only take on values
less than zero.
</p>
<p>
Wadler (1990) observed that the use of guards makes sense for an
arbitrary monad with a zero. The monad comprehension notation in Gofer
supports this use of guards. For example, the sat combinator
</p>



<pre class="example">sat :: (Char -&gt; Bool) -&gt; Parser Char
sat p = item ‘bind‘ \x -&gt;
if p x then result x else zero

</pre>


<p>
can be defined more succinctly using a comprehension with a guard:
</p>



<pre class="example">sat :: (Char -&gt; Bool) -&gt; Parser Char
sat p = [x | x &lt;- item, p x]
</pre>



<pre class="example">(defun satisfies (predicate &amp;rest args)
  (mlet* &lt;parser&gt; ((x (item)))
    (apply #'guard predicate x args)))  
</pre>


<p>
We conclude this section by noting that there is another notation that can be
used to make monadic programs easier to read: the so-called “do” notation (Jones,
1994; Jones &amp; Launchbury, 1994). For example, using this notation the combinators
string and sat can be defined as follows:
</p>



<pre class="example">string:: String -&gt; Parser String
string "" = do { result "" }
string (x:xs) = do { char x ; string xs ; result (x:xs) }

sat :: (Char -&gt; Bool) -&gt; Parser Char
sat p = do { x &lt;- item ; if (p x) ; result x }
</pre>



<p>
The do notation has a couple of advantages over monad comprehension
notation: we are not restricted to monad expressions that end with a
use of result; and generators of the form &lt;- e that do not bind
variables can be abbreviated by e.  The do notation is supported by
Gofer, but monad expressions involving parsers typically end with a
use of result (to compute the result value from the parser), so the
extra generality is not really necessary in this case. For this
reason, and for simplicity, in this article we only use the
comprehension notation. It would be an easy task, however, to
translate our definitions into the do notation.
</p>
</div>
</div>

</div>
