doc/monparsing.org
* Combinators for repetition

Parser generators such as Lex and Yacc (Aho et al., 1986) for
producing parsers written in C, and Ratatosk (Mogensen, 1993) and
Happy (Gill & Marlow, 1995) for producing parsers written in Haskell,
typically offer a fixed set of combinators for describing grammars. In
contrast, with the method of building parsers as presented in this
article the set of combinators is completely extensible: parsers are
first-class values, and we have the full power of a functional language
at our disposal to define special combinators for special applications.

In this section we define combinators for a number of common patterns
of repetition. These combinators are not specific to parsers, but can
be used with an arbitrary monad with a zero and plus. For clarity,
however, we specialise the types of the combinators to the case of
parsers.  In subsequent sections we will introduce combinators for
other purposes, including handling lexical issues and Gofer’s offside
rule.

** Simple repetition

Earlier we defined a parser word for consuming zero or more letters
from the input string. Using monad comprehension notation, the
definition is:

#+begin_src haskell
word :: Parser String
word = [x:xs | x <- letter, xs <- word] ++ [""]
#+end_src

#+begin_src lisp
  (defun word ()
   (mlet* <parser>
    (plus (mlet* <parser> 
              ((x (letter))
               (xs (word)))
            (result (cons x xs)))           
          (result nil))))
      
#+end_src

We can easily imagine a number of other parsers that exhibit a similar
structure to word. For example, parsers for strings of digits or
strings of spaces could be defined in precisely the same way, the only
difference being be that the component parser letter would be replaced
by either digit or char ’ ’. To avoid defining a number of different
parsers with a similar structure, we abstract on the pattern of
recursion in word and define a general combinator, many, that parses
sequences of items.  The combinator many applies a parser p zero or
more times to an input string.

The results from each application of p are returned in a list:

#+begin_src haskell
many :: Parser a -> Parser [a]
many p = [x:xs | x <- p, xs <- many p] ++ [[]]
#+end_src

#+name: lisp-parser-many
#+begin_src lisp
  (defun many (parser)
      (mlet* <parser> ()
        (plus (mlet* <parser> 
                  ((x parser)
                   (xs (many parser)))
                (result (cons x xs)))
              (result nil))))
#+end_src

Different parsers can be made by supplying different arguments parsers
p. For example, word can be defined just as many letter, and the other
parsers mentioned above by many digit and many (char ’ ’).

#+name: lisp word-parser-many
#+begin_src lisp
(defun word ()
  (many (letter)))
#+end_src

Just as the original word parser returns many results in general
(decreasing in the number of letters consumed from the input), so does
many p. Of course, in most cases we will only be interested in the
first parse from many p, in which p is successfully applied as many
times as possible. We will return to this point in the next section,
when we address the efficiency of parsers.

As another application of many, we can define a parser for
identifiers. For simplicity, we regard an identifier as a lower-case
letter followed by zero or more alphanumeric characters. It would be
easy to extend the definition to handle extra characters, such as
underlines or backquotes.

#+begin_src haskell
ident :: Parser String
ident = [x:xs | x <- lower, xs <- many alphanum]
#+end_src

#+begin_src lisp
(defun ident ()
  (mlet* <parser> 
    ((x (lower))
     (xs (many (alphanum))))
   (result (cons x xs))))
#+end_src

Sometimes we will only be interested in non-empty sequences of items. For this
reason we define a special combinator, many1, in terms of many:

#+begin_src haskell
many1 :: Parser a -> Parser [a]
many1 p = [x:xs | x <- p, xs <- many p]
#+end_src

#+name: lisp-parser-function many1
#+begin_src lisp
  (defun many1 (parser)
    (mlet* <parser>
        ((x parser)
         (xs (many parser)))
      (result (cons x xs))))
#+end_src


For example, applying many1 (char ’a’) to the input "aaab" gives the
result [("aaa","b"), ("aa","ab"), ("a","aab")], which is the same as
for many (char ’a’), except that the final pair ("", "aaab") is no
longer present. Note also that many1 p may fail, whereas many p always
succeeds.

#+name: test lisp many and many1
#+begin_src lisp
  (assert (equal '(((#\a #\a #\a) . "b") 
                   ((#\a #\a) . "ab")
                   ((#\a) . "aab")
                   (NIL . "aaab"))
                 (funcall (many (char #\a)) "aaab")))
  
  (assert (equal '(((#\a #\a #\a) . "b") 
                   ((#\a #\a) . "ab") 
                   ((#\a) . "aab"))
                 (funcall (many1 (char #\a)) "aaab")))  
#+end_src

Using many1 we can define a parser for natural numbers:

#+begin_src haskell
nat :: Parser Int
nat = [eval xs | xs <- many1 digit]
where
eval xs = foldl1 op [ord x - ord ’0’ | x <- xs]
m ‘op‘ n = 10*m + n
#+end_src

#+name: lisp-parser-nat
#+begin_src lisp

(defun nat () 
  (mlet* <parser>
   ((xs (many1 (digit))))
  (result (read-from-string (coerce xs 'cl:string)))))

#+end_src

#+name: test lisp-parser-nat
#+begin_src lisp
  (assert (equal '((124 . "") (12 . "4") (1 . "24")) 
                 (funcall (nat) "124")))  
#+end_src

In turn, nat can be used to define a parser for integers:

#+begin_src haskell
int :: Parser Int
int = [-n | _ <- char ’-’, n <- nat] ++ nat
#+end_src

#+name: lisp-parser-first int
#+begin_src lisp
  (defun int ()
   (mlet* <parser> ()
     (plus (mlet* <parser>
               ((_ (char #\-))
                (n (nat)))
             (result (- n)))
           (nat))))  
#+end_src

#+name: test lisp parser int
#+begin_src lisp 
  (assert (and (equal (funcall (int) "12345")
                      '((12345 . "") (1234 . "5") (123 . "45") 
                        (12 . "345") (1 . "2345")))
               (equal (funcall (int) "-12345")
                      '((-12345 . "") (-1234 . "5") (-123 . "45") 
                        (-12 . "345") (-1 . "2345")))
               (cl:null (funcall (int) "#-12345"))))
  
#+end_src

A more sophisticated way to define int is as follows. First try and
parse the negation character ’-’. If this is successful then return
the negation function as the result of the parse; otherwise return the
identity function. The final step is then to parse a natural number,
and use the function returned by attempting to parse the ’-’ character
to modify the resulting number:

#+begin_src lisp
int :: Parser Int
int = [f n | f <- op, n <- nat]
where
op = [negate | _ <- char ’-’] ++ [id]
#+end_src

#+name: lisp-parser-second int
#+begin_src lisp
  (defun int ()
    (mlet* <parser> 
        ((op (plus (mlet* <parser> ((_ (char #\-)))
                     (result #'-))
                   (result #'identity)))           
         (n (nat)))
      (result (funcall op n))))
#+end_src

