doc/monparsing.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Combinators for repetition</h2>
<div class="outline-text-2" id="text-4">


<p>
Parser generators such as Lex and Yacc (Aho et al., 1986) for
producing parsers written in C, and Ratatosk (Mogensen, 1993) and
Happy (Gill &amp; Marlow, 1995) for producing parsers written in Haskell,
typically offer a fixed set of combinators for describing grammars. In
contrast, with the method of building parsers as presented in this
article the set of combinators is completely extensible: parsers are
first-class values, and we have the full power of a functional language
at our disposal to define special combinators for special applications.
</p>
<p>
In this section we define combinators for a number of common patterns
of repetition. These combinators are not specific to parsers, but can
be used with an arbitrary monad with a zero and plus. For clarity,
however, we specialise the types of the combinators to the case of
parsers.  In subsequent sections we will introduce combinators for
other purposes, including handling lexical issues and Gofer’s offside
rule.
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Simple repetition</h3>
<div class="outline-text-3" id="text-4-1">


<p>
Earlier we defined a parser word for consuming zero or more letters
from the input string. Using monad comprehension notation, the
definition is:
</p>



<pre class="example">word :: Parser String
word = [x:xs | x &lt;- letter, xs &lt;- word] ++ [""]
</pre>



<pre class="example">(defun word ()
 (mlet* &lt;parser&gt;
  (plus (mlet* &lt;parser&gt; 
            ((x (letter))
             (xs (word)))
          (result (cons x xs)))           
        (result nil))))

</pre>


<p>
We can easily imagine a number of other parsers that exhibit a similar
structure to word. For example, parsers for strings of digits or
strings of spaces could be defined in precisely the same way, the only
difference being be that the component parser letter would be replaced
by either digit or char ’ ’. To avoid defining a number of different
parsers with a similar structure, we abstract on the pattern of
recursion in word and define a general combinator, many, that parses
sequences of items.  The combinator many applies a parser p zero or
more times to an input string.
</p>
<p>
The results from each application of p are returned in a list:
</p>



<pre class="example">many :: Parser a -&gt; Parser [a]
many p = [x:xs | x &lt;- p, xs &lt;- many p] ++ [[]]
</pre>



<pre class="example">(defun many (parser)
    (mlet* &lt;parser&gt; ()
      (plus (mlet* &lt;parser&gt; 
                ((x parser)
                 (xs (many parser)))
              (result (cons x xs)))
            (result nil))))
</pre>


<p>
Different parsers can be made by supplying different arguments parsers
p. For example, word can be defined just as many letter, and the other
parsers mentioned above by many digit and many (char ’ ’).
</p>



<pre class="example">(defun word ()
  (many (letter)))
</pre>


<p>
Just as the original word parser returns many results in general
(decreasing in the number of letters consumed from the input), so does
many p. Of course, in most cases we will only be interested in the
first parse from many p, in which p is successfully applied as many
times as possible. We will return to this point in the next section,
when we address the efficiency of parsers.
</p>
<p>
As another application of many, we can define a parser for
identifiers. For simplicity, we regard an identifier as a lower-case
letter followed by zero or more alphanumeric characters. It would be
easy to extend the definition to handle extra characters, such as
underlines or backquotes.
</p>



<pre class="example">ident :: Parser String
ident = [x:xs | x &lt;- lower, xs &lt;- many alphanum]
</pre>



<pre class="example">(defun ident ()
  (mlet* &lt;parser&gt; 
    ((x (lower))
     (xs (many (alphanum))))
   (result (cons x xs))))
</pre>


<p>
Sometimes we will only be interested in non-empty sequences of items. For this
reason we define a special combinator, many1, in terms of many:
</p>



<pre class="example">many1 :: Parser a -&gt; Parser [a]
many1 p = [x:xs | x &lt;- p, xs &lt;- many p]
</pre>



<pre class="example">(defun many1 (parser)
  (mlet* &lt;parser&gt;
      ((x parser)
       (xs (many parser)))
    (result (cons x xs))))
</pre>



<p>
For example, applying many1 (char ’a’) to the input "aaab" gives the
result [("aaa","b"), ("aa","ab"), ("a","aab")], which is the same as
for many (char ’a’), except that the final pair ("", "aaab") is no
longer present. Note also that many1 p may fail, whereas many p always
succeeds.
</p>



<pre class="example">(assert (equal '(((#\a #\a #\a) . "b") 
                 ((#\a #\a) . "ab")
                 ((#\a) . "aab")
                 (NIL . "aaab"))
               (funcall (many (char #\a)) "aaab")))

(assert (equal '(((#\a #\a #\a) . "b") 
                 ((#\a #\a) . "ab") 
                 ((#\a) . "aab"))
               (funcall (many1 (char #\a)) "aaab")))  
</pre>


<p>
Using many1 we can define a parser for natural numbers:
</p>



<pre class="example">nat :: Parser Int
nat = [eval xs | xs &lt;- many1 digit]
where
eval xs = foldl1 op [ord x - ord ’0’ | x &lt;- xs]
m ‘op‘ n = 10*m + n
</pre>



<pre class="example">
(defun nat () 
  (mlet* &lt;parser&gt;
   ((xs (many1 (digit))))
  (result (read-from-string (coerce xs 'cl:string)))))

</pre>



<pre class="example">(assert (equal '((124 . "") (12 . "4") (1 . "24")) 
               (funcall (nat) "124")))  
</pre>


<p>
In turn, nat can be used to define a parser for integers:
</p>



<pre class="example">int :: Parser Int
int = [-n | _ &lt;- char ’-’, n &lt;- nat] ++ nat
</pre>



<pre class="example">(defun int ()
 (mlet* &lt;parser&gt; ()
   (plus (mlet* &lt;parser&gt;
             ((_ (char #\-))
              (n (nat)))
           (result (- n)))
         (nat))))  
</pre>



<pre class="example">(assert (and (equal (funcall (int) "12345")
                    '((12345 . "") (1234 . "5") (123 . "45") 
                      (12 . "345") (1 . "2345")))
             (equal (funcall (int) "-12345")
                    '((-12345 . "") (-1234 . "5") (-123 . "45") 
                      (-12 . "345") (-1 . "2345")))
             (cl:null (funcall (int) "#-12345"))))

</pre>


<p>
A more sophisticated way to define int is as follows. First try and
parse the negation character ’-’. If this is successful then return
the negation function as the result of the parse; otherwise return the
identity function. The final step is then to parse a natural number,
and use the function returned by attempting to parse the ’-’ character
to modify the resulting number:
</p>



<pre class="example">int :: Parser Int
int = [f n | f &lt;- op, n &lt;- nat]
where
op = [negate | _ &lt;- char ’-’] ++ [id]
</pre>



<pre class="example">(defun int ()
  (mlet* &lt;parser&gt; 
      ((op (plus (mlet* &lt;parser&gt; ((_ (char #\-)))
                   (result #'-))
                 (result #'identity)))           
       (n (nat)))
    (result (funcall op n))))
</pre>


</div>

</div>
