doc/monparsing.org
** Repetition with separators

The many combinators parse sequences of items. Now we consider a slightly more
general pattern of repetition, in which separators between the items are involved.
Consider the problem of parsing a non-empty list of integers, such as [1,-42,17].
Such a parser can be defined in terms of the many combinator as follows:

#+begin_src haskell
ints :: Parser [Int]
ints = [n:ns | _ <- char ’[’, 
               n <- int , 
               ns <- many [x | _ <- char ’,’, x <- int], 
               _ <- char ’]’]
#+end_src

#+name: ints first lisp-parser-
#+begin_src lisp
  (defun ints () 
    (mlet* <parser> 
        ((_ (char #\[))
         (n (int))
         (ns (many (mlet* <parser>
                       ((_ (char #\,))
                        (x (int)))
                     (result x))))
         (_ (char #\])))
      (result (cons n ns))))    
#+end_src

#+name: ints test lisp <parser> 
#+begin_src lisp
  (assert (equal (funcall (ints) "[1,234,567]")
                 '(((1 234 567) . ""))))
#+end_src

As was the case in the previous section for the word parser, we can imagine a
number of other parsers with a similar structure to ints, so it is useful to abstract
on the pattern of repetition and define a general purpose combinator, which we
call sepby1. The combinator *sepby1* is like *many1* in that it recognises non-empty
sequences of a given parser p, but different in that the instances of p are separated
by a parser sep whose result values are ignored:

#+begin_src haskell
sepby1:: Parser a -> Parser b -> Parser [a]
p ‘sepby1‘ sep = [x:xs | x <- p
                       , xs <- many [y | _ <- sep
                                       , y <- p]]
#+end_src

#+name: sepby1 lisp-parser-
#+begin_src lisp 
(defun sepby1 (parser sep)
  (mlet* <parser>
     ((x parser)
      (xs (many (mlet* <parser> 
                 ((_ sep) 
                  (y parser))
                 (result y)))))
     (result (cons x xs))))
#+end_src

Note that the fact that the results of the sep parser are ignored is
reflected in the type of the sepby1 combinator: the sep parser gives
results of type b, but this type does not occur in the type [a] of the
results of the combinator.  Now ints can be defined in a more compact
form:

#+begin_src haskell
ints = [ns | _ <- char ’[’ 
           , ns <- int ‘sepby1‘ char ’,’ 
           , _ <- char ’]’]
#+end_src

#+name: second ints lisp-parser-interface 
#+begin_src lisp
  (defun ints ()
    (mlet* <parser> 
        ((_ (char #\[))
         (ns (sepby1 (int) (char #\,)))
         (_ (char #\])))
      (result ns)))
  
#+end_src

In fact we can go a little further. The bracketing of parsers by other parsers whose
results are ignored — in the case above, the bracketing parsers are char ’[’ and
char ’]’ — is common enough to also merit its own combinator:

#+begin_src haskell
bracket :: Parser a -> Parser b -> Parser c -> Parser b
bracket open p close = [x | _ <- open, x <- p, _ <- close]
#+end_src

#+name: bracket lisp-parser-
#+begin_src lisp 
  (defun bracket (open-parser parser close-parser)
    (mlet* <parser>
        ((_ open-parser)
         (x parser)
         (_ close-parser))
      (result x)))
#+end_src

Now ints can be defined just as

#+begin_src haskell
ints = bracket (char ’[’) (int ‘sepby1‘ char ’,’) (char ’]’ )
#+end_src

#+name: third ints lisp-parser- 
#+begin_src lisp  
  (defun ints () 
    (bracket (char #\[) (sepby1 (int) (char #\,)) (char #\])))  
#+end_src


Finally, while many1 was defined in terms of many, the combinator sepby (for
possibly-empty sequences) is naturally defined in terms of sepby1:


#+begin_src haskell
sepby :: Parser a -> Parser b -> Parser [a]
p ‘sepby‘ sep = (p ‘sepby1‘ sep) ++ [[]]
#+end_src

#+name: sepby lisp-parser-
#+begin_src lisp
(defun sepby (parser sep)
  (mlet* <parser> ()
    (plus (sepby1 parser sep) 
          (result nil))))
#+end_src

