doc/monparsing.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Repetition with separators</h3>
<div class="outline-text-3" id="text-4-2">


<p>
The many combinators parse sequences of items. Now we consider a slightly more
general pattern of repetition, in which separators between the items are involved.
Consider the problem of parsing a non-empty list of integers, such as [1,-42,17].
Such a parser can be defined in terms of the many combinator as follows:
</p>



<pre class="example">ints :: Parser [Int]
ints = [n:ns | _ &lt;- char ’[’, 
               n &lt;- int , 
               ns &lt;- many [x | _ &lt;- char ’,’, x &lt;- int], 
               _ &lt;- char ’]’]
</pre>



<pre class="example">(defun ints () 
  (mlet* &lt;parser&gt; 
      ((_ (char #\[))
       (n (int))
       (ns (many (mlet* &lt;parser&gt;
                     ((_ (char #\,))
                      (x (int)))
                   (result x))))
       (_ (char #\])))
    (result (cons n ns))))    
</pre>



<pre class="example">(assert (equal (funcall (ints) "[1,234,567]")
               '(((1 234 567) . ""))))
</pre>


<p>
As was the case in the previous section for the word parser, we can imagine a
number of other parsers with a similar structure to ints, so it is useful to abstract
on the pattern of repetition and define a general purpose combinator, which we
call sepby1. The combinator <b>sepby1</b> is like <b>many1</b> in that it recognises non-empty
sequences of a given parser p, but different in that the instances of p are separated
by a parser sep whose result values are ignored:
</p>



<pre class="example">sepby1:: Parser a -&gt; Parser b -&gt; Parser [a]
p ‘sepby1‘ sep = [x:xs | x &lt;- p
                       , xs &lt;- many [y | _ &lt;- sep
                                       , y &lt;- p]]
</pre>



<pre class="example">(defun sepby1 (parser sep)
  (mlet* &lt;parser&gt;
     ((x parser)
      (xs (many (mlet* &lt;parser&gt; 
                 ((_ sep) 
                  (y parser))
                 (result y)))))
     (result (cons x xs))))
</pre>


<p>
Note that the fact that the results of the sep parser are ignored is
reflected in the type of the sepby1 combinator: the sep parser gives
results of type b, but this type does not occur in the type [a] of the
results of the combinator.  Now ints can be defined in a more compact
form:
</p>



<pre class="example">ints = [ns | _ &lt;- char ’[’ 
           , ns &lt;- int ‘sepby1‘ char ’,’ 
           , _ &lt;- char ’]’]
</pre>



<pre class="example">(defun ints ()
  (mlet* &lt;parser&gt; 
      ((_ (char #\[))
       (ns (sepby1 (int) (char #\,)))
       (_ (char #\])))
    (result ns)))

</pre>


<p>
In fact we can go a little further. The bracketing of parsers by other parsers whose
results are ignored — in the case above, the bracketing parsers are char ’[’ and
char ’]’ — is common enough to also merit its own combinator:
</p>



<pre class="example">bracket :: Parser a -&gt; Parser b -&gt; Parser c -&gt; Parser b
bracket open p close = [x | _ &lt;- open, x &lt;- p, _ &lt;- close]
</pre>



<pre class="example">(defun bracket (open-parser parser close-parser)
  (mlet* &lt;parser&gt;
      ((_ open-parser)
       (x parser)
       (_ close-parser))
    (result x)))
</pre>


<p>
Now ints can be defined just as
</p>



<pre class="example">ints = bracket (char ’[’) (int ‘sepby1‘ char ’,’) (char ’]’ )
</pre>



<pre class="example">(defun ints () 
  (bracket (char #\[) (sepby1 (int) (char #\,)) (char #\])))  
</pre>



<p>
Finally, while many1 was defined in terms of many, the combinator sepby (for
possibly-empty sequences) is naturally defined in terms of sepby1:
</p>




<pre class="example">sepby :: Parser a -&gt; Parser b -&gt; Parser [a]
p ‘sepby‘ sep = (p ‘sepby1‘ sep) ++ [[]]
</pre>



<pre class="example">(defun sepby (parser sep)
  (mlet* &lt;parser&gt; ()
    (plus (sepby1 parser sep) 
          (result nil))))
</pre>


</div>

</div>
