doc/monparsing.org
** Repetition with meaningful separators

The sepby combinators handle the case of parsing sequences of items
separated by text that can be ignored. In this final section on
repetition, we address the more general case in which the separators
themselves carry meaning. The combinators defined in this section are
due to Fokker (1995).

Consider the problem of parsing simple arithmetic expressions such as
1+2-(3+4), built up from natural numbers using addition, subtraction,
and parentheses. The two arithmetic operators are assumed to associate
to the left (thus, for example, 1-2-3 should be parsed as (1-2)-3),
and have the same precedence. The standard BNF grammar for such
expressions is written as follows:

#+begin_src dot
 expr  ::= expr addop factor | factor
 addop ::= + | -
 factor ::= + | nat | ( expr ) 
#+end_src

This grammar can be translated directly into a combinator parser:

#+begin_src haskell
  expr :: Parser Int
  addop :: Parser (Int -> Int -> Int)
  factor :: Parser Int
  expr = [f x y | x <- expr, f <- addop, y <- factor] ++ factor
  
  addop = [(+) | _ <- char ’+’] ++ [(-) | _ <- char ’-’]
  
  factor = nat ++ bracket (char ’(’) expr (char ’)’)
#+end_src

#+begin_src lisp
  (defun expr ()
    (mlet* <parser> ()
      (plus  (mlet* <parser>
                 ((x (expr))
                  (f (addop))
                  (y (factor)))
               (result (funcall f x y)))
             (factor))))
#+end_src

#+begin_src lisp      
      (defun addop ()
        (mlet* <parser> ()
          (plus (mlet* <parser> ((_ (char #\+)))
                  (result #'+))
                (mlet* <parser> ((_ (char #\-)))
                  (result #'-)))))
  
  
  (defun factor ()
    (mlet* <parser> () (plus (nat) (bracket (char #\() (expr) (char #\))))))
              
#+end_src

In fact, rather than just returning some kind of parse tree, the expr parser above
actually evaluates arithmetic expressions to their integer value: the addop parser
returns a function as its result value, which is used to combine the result values
produced by parsing the arguments to the operator.

Of course, however, there is a problem with the expr parser as defined
above.  The fact that the operators associate to the left is taken
account of by expr being left-recursive (the first thing it does is
make a recursive call to itself). Thus expr never makes any progress,
and hence does not terminate.

As is well-known, this kind of non-termination for parsers can be
solved by replacing left-recursion by iteration. Looking at the expr
grammar, we see that an expression is a sequence of factor s,
separated by addops. Thus the parser for expressions can be re-defined
using many as follows:

#+begin_src haskell
expr = [... | x <- factor
            , fys <- many [(f,y) | f <- addop, y <- factor]]
#+end_src

This takes care of the non-termination, but it still remains to fill in the “...” part
of the new definition, which computes the value of an expression.

Suppose now that the input string is "1-2+3-4". Then after parsing using expr,
the variable x will be 1 and fys will be the list [((-),2), ((+),3), ((-),4)].
These can be reduced to a single value 1-2+3-4 = ((1-2)+3)-4 = -2 by folding:
the built-in function foldl is such that, for example, foldl g a [b,c,d,e] =
((a ‘g‘ b) ‘g‘ c) ‘g‘ d) ‘g‘ e. In the present case, we need to take g as the
function \x (f,y) -> f x y, and a as the integer x:

#+begin_sr chaskell
expr = [foldl (\x (f,y) -> f x y) x fys | x <- factor
                                        , fys <- many [(f,y) | f <- addop, y <- factor]]
#+end_src


Now, for example, applying expr to the input string "1+2-(3+4)" gives the result
[(-4,""), (3,"-(3+4)", (1,"+2-(3+4)")], as expected.
Playing the generalisation game once again, we can abstract on the pattern of
repetition in expr and define a new combinator. The combinator, chainl1, parses
non-empty sequences of items separated by operators that associate to the left:

#+begin_src haskell
chainl1 :: Parser a -> Parser (a -> a -> a) -> Parser a
p ‘chainl1‘ op = [foldl (\x (f,y) -> f x y) x fys
                  | x <- p , fys <- many [(f,y) | f <- op, y <- p]]
#+end_src

Thus our parser for expressions can now be written as follows:

#+begin_src haskell
expr = factor ‘chainl1‘ addop

addop = [(+) | _ <- char ’+’] ++ [(-) | _ <- char ’-’]
factor = nat ++ bracket (char ’(’) expr (char ’)’)
#+end_src

Most operator parsers will have a similar structure to addop above, so it is useful
to abstract a combinator for building such parsers:

#+begin_src haskell
ops:: [(Parser a, b)] -> Parser b
ops xs = foldr1 (++) [[op | _ <- p] | (p,op) <- xs]
#+end_src

The built-in function foldr1 is such that, for example, foldr1 g [a,b,c,d] = a
‘g‘ (b ‘g‘ (c ‘g‘ d)). It is defined for any non-empty list. In the above case
then, foldr1 places the choice operator (++) between each parser in the list. Using
ops, our addop parser can now be defined by

#+begin_src haskell
addop = ops [(char ’+’, (+)), (char ’-’, (-))]
#+end_src

A possible inefficiency in the definition of the chainl1 combinator is the construction of the intermediate list fys. This can be avoided by giving a direct recursive definition of chainl1 that does not make use of foldl and many, using an
accumulating parameter to construct the final result:

#+begin_src haskell
chainl1 :: Parser a -> Parser (a -> a -> a) -> Parser a
p ‘chainl1‘ op = p ‘bind‘ rest
where
rest x = (op ‘bind‘ \f ->
p ‘bind‘ \y ->
rest (f x y)) ++ [x]

#+end_src
This definition has a natural operational reading. The parser p ‘chainl1‘ op first
parses a single p, whose result value becomes the initial accumulator for the rest
function. Then it attempts to parse an operator and a single p. If successful, the
accumulator and the result from p are combined using the function f returned from
parsing the operator, and the resulting value becomes the new accumulator when
parsing the remainder of the sequence (using a recursive call to rest). Otherwise,
the sequence is finished, and the accumulator is returned.

As another interesting application of chainl1, we can redefine our earlier parser
nat for natural numbers such that it does not construct an intermediate list of
digits. In this case, the op parser does not do any parsing, but returns the function
that combines a natural and a digit:

#+begin_src haskell
nat :: Parser Int
nat = [ord x - ord ’0’ | x <- digit] ‘chainl1‘ [op]
where
m ‘op‘ n = 10*m + n
#+end_src

Naturally, we can also define a combinator chainr1 that parses non-empty sequences of items separated by operators that associate to the right, rather than to
the left. For simplicity, we only give the direct recursive definition:

#+begin_src haskell
chainr1 :: Parser a -> Parser (a -> a -> a) -> Parser a
p ‘chainr1‘ op =
p ‘bind‘ \x ->
[f x y | f <- op, y <- p ‘chainr1‘ op] ++ [x]
#+end_src

That is, p ‘chainr1‘ op first parses a single p. Then it attempts to
parse an operator and the rest of the sequence (using a recursive call
to chainr1). If successful,

the pair of results from the first p and the rest of the sequence are combined using the function f returned from parsing the operator. Otherwise, the sequence is
finished, and the result from p is returned.

As an example of using chainr1, we extend our parser for arithmetic expressions
to handle exponentiation; this operator has higher precedence than the previous
two operators, and associates to the right:

#+begin_src haskell
expr

= term

‘chainl1‘ addop

term

= factor ‘chainr1‘ expop

factor = nat ++ bracket (char ’(’) expr (char ’)’)
addop

= ops [(char ’+’, (+)), (char ’-’, (-))]

expop

= ops [(char ’^’, (^))]

#+end_src

For completeness, we also define combinators chainl and chainr that have the
same behaviour as chainl1 and chainr1, except that they can also consume no
input, in which case a given value v is returned as the result:

#+begin_src haskell
chainl :: Parser a -> Parser (a -> a -> a) -> a -> Parser a
chainl p op v = (p ‘chainl1‘ op) ++ [v]
chainr :: Parser a -> Parser (a -> a -> a) -> a -> Parser a
chainr p op v = (p ‘chainr1‘ op) ++ [v]
#+end_src

In summary then, chainl and chainr provide a simple way to build
parsers for expression-like grammars. Using these combinators avoids
the need for transformations to remove left-recursion in the grammar,
that would otherwise result in non-termination of the parser. They
also avoid the need for left-factorisation of the grammar, that would
otherwise result in unnecessary backtracking; we will return to this
point in the next section.

