doc/monparsing.html

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Repetition with meaningful separators</h3>
<div class="outline-text-3" id="text-4-3">


<p>
The sepby combinators handle the case of parsing sequences of items
separated by text that can be ignored. In this final section on
repetition, we address the more general case in which the separators
themselves carry meaning. The combinators defined in this section are
due to Fokker (1995).
</p>
<p>
Consider the problem of parsing simple arithmetic expressions such as
1+2-(3+4), built up from natural numbers using addition, subtraction,
and parentheses. The two arithmetic operators are assumed to associate
to the left (thus, for example, 1-2-3 should be parsed as (1-2)-3),
and have the same precedence. The standard BNF grammar for such
expressions is written as follows:
</p>



<pre class="example">expr  ::= expr addop factor | factor
addop ::= + | -
factor ::= + | nat | ( expr ) 
</pre>


<p>
This grammar can be translated directly into a combinator parser:
</p>



<pre class="example">expr :: Parser Int
addop :: Parser (Int -&gt; Int -&gt; Int)
factor :: Parser Int
expr = [f x y | x &lt;- expr, f &lt;- addop, y &lt;- factor] ++ factor

addop = [(+) | _ &lt;- char ’+’] ++ [(-) | _ &lt;- char ’-’]

factor = nat ++ bracket (char ’(’) expr (char ’)’)
</pre>



<pre class="example">(defun expr ()
  (mlet* &lt;parser&gt; ()
    (plus  (mlet* &lt;parser&gt;
               ((x (expr))
                (f (addop))
                (y (factor)))
             (result (funcall f x y)))
           (factor))))
</pre>



<pre class="example">    (defun addop ()
      (mlet* &lt;parser&gt; ()
        (plus (mlet* &lt;parser&gt; ((_ (char #\+)))
                (result #'+))
              (mlet* &lt;parser&gt; ((_ (char #\-)))
                (result #'-)))))


(defun factor ()
  (mlet* &lt;parser&gt; () (plus (nat) (bracket (char #\() (expr) (char #\))))))

</pre>


<p>
In fact, rather than just returning some kind of parse tree, the expr parser above
actually evaluates arithmetic expressions to their integer value: the addop parser
returns a function as its result value, which is used to combine the result values
produced by parsing the arguments to the operator.
</p>
<p>
Of course, however, there is a problem with the expr parser as defined
above.  The fact that the operators associate to the left is taken
account of by expr being left-recursive (the first thing it does is
make a recursive call to itself). Thus expr never makes any progress,
and hence does not terminate.
</p>
<p>
As is well-known, this kind of non-termination for parsers can be
solved by replacing left-recursion by iteration. Looking at the expr
grammar, we see that an expression is a sequence of factor s,
separated by addops. Thus the parser for expressions can be re-defined
using many as follows:
</p>



<pre class="example">expr = [... | x &lt;- factor
            , fys &lt;- many [(f,y) | f &lt;- addop, y &lt;- factor]]
</pre>


<p>
This takes care of the non-termination, but it still remains to fill in the “&hellip;” part
of the new definition, which computes the value of an expression.
</p>
<p>
Suppose now that the input string is "1-2+3-4". Then after parsing using expr,
the variable x will be 1 and fys will be the list [((-),2), ((+),3), ((-),4)].
These can be reduced to a single value 1-2+3-4 = ((1-2)+3)-4 = -2 by folding:
the built-in function foldl is such that, for example, foldl g a [b,c,d,e] =
((a ‘g‘ b) ‘g‘ c) ‘g‘ d) ‘g‘ e. In the present case, we need to take g as the
function \x (f,y) -&gt; f x y, and a as the integer x:
</p>
<p>
expr = [foldl (\x (f,y) -&gt; f x y) x fys | x &lt;- factor
                                        , fys &lt;- many [(f,y) | f &lt;- addop, y &lt;- factor]]
</p>

<p>
Now, for example, applying expr to the input string "1+2-(3+4)" gives the result
[(-4,""), (3,"-(3+4)", (1,"+2-(3+4)")], as expected.
Playing the generalisation game once again, we can abstract on the pattern of
repetition in expr and define a new combinator. The combinator, chainl1, parses
non-empty sequences of items separated by operators that associate to the left:
</p>



<pre class="example">chainl1 :: Parser a -&gt; Parser (a -&gt; a -&gt; a) -&gt; Parser a
p ‘chainl1‘ op = [foldl (\x (f,y) -&gt; f x y) x fys
                  | x &lt;- p , fys &lt;- many [(f,y) | f &lt;- op, y &lt;- p]]
</pre>


<p>
Thus our parser for expressions can now be written as follows:
</p>



<pre class="example">expr = factor ‘chainl1‘ addop

addop = [(+) | _ &lt;- char ’+’] ++ [(-) | _ &lt;- char ’-’]
factor = nat ++ bracket (char ’(’) expr (char ’)’)
</pre>


<p>
Most operator parsers will have a similar structure to addop above, so it is useful
to abstract a combinator for building such parsers:
</p>



<pre class="example">ops:: [(Parser a, b)] -&gt; Parser b
ops xs = foldr1 (++) [[op | _ &lt;- p] | (p,op) &lt;- xs]
</pre>


<p>
The built-in function foldr1 is such that, for example, foldr1 g [a,b,c,d] = a
‘g‘ (b ‘g‘ (c ‘g‘ d)). It is defined for any non-empty list. In the above case
then, foldr1 places the choice operator (++) between each parser in the list. Using
ops, our addop parser can now be defined by
</p>



<pre class="example">addop = ops [(char ’+’, (+)), (char ’-’, (-))]
</pre>


<p>
A possible inefficiency in the definition of the chainl1 combinator is the construction of the intermediate list fys. This can be avoided by giving a direct recursive definition of chainl1 that does not make use of foldl and many, using an
accumulating parameter to construct the final result:
</p>



<pre class="example">chainl1 :: Parser a -&gt; Parser (a -&gt; a -&gt; a) -&gt; Parser a
p ‘chainl1‘ op = p ‘bind‘ rest
where
rest x = (op ‘bind‘ \f -&gt;
p ‘bind‘ \y -&gt;
rest (f x y)) ++ [x]

</pre>

<p>
This definition has a natural operational reading. The parser p ‘chainl1‘ op first
parses a single p, whose result value becomes the initial accumulator for the rest
function. Then it attempts to parse an operator and a single p. If successful, the
accumulator and the result from p are combined using the function f returned from
parsing the operator, and the resulting value becomes the new accumulator when
parsing the remainder of the sequence (using a recursive call to rest). Otherwise,
the sequence is finished, and the accumulator is returned.
</p>
<p>
As another interesting application of chainl1, we can redefine our earlier parser
nat for natural numbers such that it does not construct an intermediate list of
digits. In this case, the op parser does not do any parsing, but returns the function
that combines a natural and a digit:
</p>



<pre class="example">nat :: Parser Int
nat = [ord x - ord ’0’ | x &lt;- digit] ‘chainl1‘ [op]
where
m ‘op‘ n = 10*m + n
</pre>


<p>
Naturally, we can also define a combinator chainr1 that parses non-empty sequences of items separated by operators that associate to the right, rather than to
the left. For simplicity, we only give the direct recursive definition:
</p>



<pre class="example">chainr1 :: Parser a -&gt; Parser (a -&gt; a -&gt; a) -&gt; Parser a
p ‘chainr1‘ op =
p ‘bind‘ \x -&gt;
[f x y | f &lt;- op, y &lt;- p ‘chainr1‘ op] ++ [x]
</pre>


<p>
That is, p ‘chainr1‘ op first parses a single p. Then it attempts to
parse an operator and the rest of the sequence (using a recursive call
to chainr1). If successful,
</p>
<p>
the pair of results from the first p and the rest of the sequence are combined using the function f returned from parsing the operator. Otherwise, the sequence is
finished, and the result from p is returned.
</p>
<p>
As an example of using chainr1, we extend our parser for arithmetic expressions
to handle exponentiation; this operator has higher precedence than the previous
two operators, and associates to the right:
</p>



<pre class="example">expr

= term

‘chainl1‘ addop

term

= factor ‘chainr1‘ expop

factor = nat ++ bracket (char ’(’) expr (char ’)’)
addop

= ops [(char ’+’, (+)), (char ’-’, (-))]

expop

= ops [(char ’^’, (^))]

</pre>


<p>
For completeness, we also define combinators chainl and chainr that have the
same behaviour as chainl1 and chainr1, except that they can also consume no
input, in which case a given value v is returned as the result:
</p>



<pre class="example">chainl :: Parser a -&gt; Parser (a -&gt; a -&gt; a) -&gt; a -&gt; Parser a
chainl p op v = (p ‘chainl1‘ op) ++ [v]
chainr :: Parser a -&gt; Parser (a -&gt; a -&gt; a) -&gt; a -&gt; Parser a
chainr p op v = (p ‘chainr1‘ op) ++ [v]
</pre>


<p>
In summary then, chainl and chainr provide a simple way to build
parsers for expression-like grammars. Using these combinators avoids
the need for transformations to remove left-recursion in the grammar,
that would otherwise result in non-termination of the parser. They
also avoid the need for left-factorisation of the grammar, that would
otherwise result in unnecessary backtracking; we will return to this
point in the next section.
</p>
</div>
</div>

</div>
