doc/monparsing.org
* Appendix: a parser for data definitions
To illustrate the monadic parser combinators developed in this article in a real-life
setting, we consider the problem of parsing a sequence of Gofer datatype definitions.
An example of such a sequence is as follows:
data List a = Nil | Cons a (List a)
data Tree a b = Leaf a
| Node (Tree a b, b, Tree a b)
Within the parser, datatypes will be represented as follows:
type Data = (String,
[String],
[(String,[Type])])

-- type name
-- parameters
-- constructors and arguments

The representation Type for types will be treated shortly. A parser datadecls ::
Parser [Data] for a sequence of datatypes can now be defined by
datadecls

= many_offside datadecl

datadecl

= [(x,xs,b) |
,
,
,
,

_
x
xs
_
b

<<<<<-

symbol "data"
constructor
many variable
symbol "="
condecl ‘sepby1‘ symbol "|"]

constructor = token [(x:xs) | x <- upper
, xs <- many alphanum]
variable

= identifier ["data"]

condecl

= [(x,ts) | x <- constructor
, ts <- many type2]

There are a couple of points worth noting about this parser. Firstly, all lexical
issues (white-space and comments, the oﬀside rule, and keywords) are handled by
combinators. And secondly, since constructor is a parser for a complete token, the
token combinator is applied within its definition.

Monadic Parser Combinators

37

Within the parser, types will be represented as follows:
data Type

=
|
|
|
|
|

Arrow Type Type
Apply Type Type
Var String
Con String
Tuple [Type]
List Type

-------

function
application
variable
constructor
tuple
list

A parser type0 :: Parser Type for types can now be defined by
type0
type1
type2

= type1 ‘chainr1‘ [Arrow | _ <- symbol "->"]
= type2 ‘chainl1‘ [Apply]
= var +++ con +++ list +++ tuple

var

= [Var x | x <- variable]

con

= [Con x | x <- constructor]

list

= [List x | x <- bracket
(symbol "[")
type0
(symbol "]")]

tuple

= [f ts | ts <- bracket
(symbol "(")
(type0 ‘sepby‘ symbol ",")
(symbol ")")]
where f [t] = t
f ts = Tuple ts

Note how chainr1 and chainl1 are used to handle parsing of function-types and
application. Note also that (as in Gofer) building a singleton tuple (t) of a type t
is not possible, since (t) is treated as a parenthesised expression.
References
Aho, A., Sethi, R., & Ullman, J. (1986). Compilers — principles, techniques and tools.
Addison-Wesley.
Burge, W.H. (1975). Recursive programming techniques. Addison-Wesley.
Fokker, Jeroen. 1995 (May). Functional parsers. Lecture notes of the Baastad Spring
school on functional programming.
Gill, Andy, & Marlow, Simon. 1995 (Jan.). Happy: the parser generator for Haskell.
University of Glasgow.
Hughes, John. (1989). Why functional programming matters. The computer journal,
32(2), 98–107.
Hutton, Graham. (1992). Higher-order functions for parsing. Journal of functional programming, 2(3), 323–343.

38

Graham Hutton and Erik Meijer

Jones, Mark P. (1994). Gofer 2.30a release notes. Unpublished manuscript.
Jones, Mark P. (1995a). Functional programming beyond the Hindley/Milner type system.
Proc. lecture notes of the Baastad spring school on functional programming.
Jones, Mark P. (1995b). The Gofer distribution. Available from the University of Nottingham: http://www.cs.nott.ac.uk/Department/Staff/mpj/.
Jones, Mark P. (1995c). A system of constructor classes: overloading and implicit higherorder polymorphism. Journal of functional programming, 5(1), 1–35.
Jones, Simon Peyton, & Launchbury, John. (1994). State in Haskell. University of Glasgow.
Landin, Peter. (1966). The next 700 programming languages. Communications of the
ACM, 9(3).
Mogensen, Torben. (1993). Ratatosk: a parser generator and scanner generator for Gofer.
University of Copenhagen (DIKU).
Moggi, Eugenio. (1989). Computation lambda-calculus and monads. Proc. IEEE symposium on logic in computer science. A extended version of the paper is available as a
technical report from the University of Edinburgh.
R¨jemo, Niklas. (1995). Garbage collection and memory efficiency in lazy functional lano
guages. Ph.D. thesis, Chalmers University of Technology.
Spivey, Mike. (1990). A functional theory of exceptions. Science of computer programming,
14, 25–42.
Wadler, Philip. (1985). How to replace failure by a list of successes. Proc. conference on
functional programming and computer architecture. Springer–Verlag.
Wadler, Philip. (1990). Comprehending monads. Proc. ACM conference on Lisp and
functional programming.
Wadler, Philip. (1992a). The essence of functional programming. Proc. principles of
programming languages.
Wadler, Philip. (1992b). Monads for functional programming. Broy, Manfred (ed), Proc.
Marktoberdorf Summer school on program design calculi. Springer–Verlag.


sat produced by parsing the arguments to the operator.

Of course, however, there is a problem with the expr parser as defined above.
The fact that the operators associate to the left is taken account of by expr being
left-recursive (the first thing it does is make a recursive call to itself). Thus expr
never makes any progress, and hence does not terminate.

As is well-known, this kind of non-termination for parsers can be solved by replacing left-recursion by iteration. Looking at the expr grammar, we see that an
expression is a sequence of factor s, separated by addops. Thus the parser for expressions can be re-defined using many as follows:
expr = [... | x
<- factor
, fys <- many [(f,y) | f <- addop, y <- factor]]

This takes care of the non-termination, but it still remains to fill in the “...” part
of the new definition, which computes the value of an expression.
Suppose now that the input string is "1-2+3-4". Then after parsing using expr,
the variable x will be 1 and fys will be the list [((-),2), ((+),3), ((-),4)].
These can be reduced to a single value 1-2+3-4 = ((1-2)+3)-4 = -2 by folding:
the built-in function foldl is such that, for example, foldl g a [b,c,d,e] =
((a ‘g‘ b) ‘g‘ c) ‘g‘ d) ‘g‘ e. In the present case, we need to take g as the
function \x (f,y) -> f x y, and a as the integer x:
expr = [foldl (\x (f,y) -> f x y) x fys
| x
<- factor
, fys <- many [(f,y) | f <- addop, y <- factor]]
Now, for example, applying expr to the input string "1+2-(3+4)" gives the result
[(-4,""), (3,"-(3+4)", (1,"+2-(3+4)")], as expected.
Playing the generalisation game once again, we can abstract on the pattern of
repetition in expr and define a new combinator. The combinator, chainl1, parses
non-empty sequences of items separated by operators that associate to the left:
chainl1
:: Parser a -> Parser (a -> a -> a) -> Parser a
p ‘chainl1‘ op = [foldl (\x (f,y) -> f x y) x fys
| x
<- p
, fys <- many [(f,y) | f <- op, y <- p]]
Thus our parser for expressions can now be written as follows:
expr

= factor ‘chainl1‘ addop

addop

= [(+) | _ <- char ’+’] ++ [(-) | _ <- char ’-’]

factor = nat ++ bracket (char ’(’) expr (char ’)’)
Most operator parsers will have a similar structure to addop above, so it is useful
to abstract a combinator for building such parsers:

Monadic Parser Combinators

17

ops
:: [(Parser a, b)] -> Parser b
ops xs = foldr1 (++) [[op | _ <- p] | (p,op) <- xs]
The built-in function foldr1 is such that, for example, foldr1 g [a,b,c,d] = a
‘g‘ (b ‘g‘ (c ‘g‘ d)). It is defined for any non-empty list. In the above case
then, foldr1 places the choice operator (++) between each parser in the list. Using
ops, our addop parser can now be defined by
addop = ops [(char ’+’, (+)), (char ’-’, (-))]
A possible inefficiency in the definition of the chainl1 combinator is the construction of the intermediate list fys. This can be avoided by giving a direct recursive definition of chainl1 that does not make use of foldl and many, using an
accumulating parameter to construct the final result:
chainl1
:: Parser a -> Parser (a -> a -> a) -> Parser a
p ‘chainl1‘ op = p ‘bind‘ rest
where
rest x = (op ‘bind‘ \f ->
p ‘bind‘ \y ->
rest (f x y)) ++ [x]
This definition has a natural operational reading. The parser p ‘chainl1‘ op first
parses a single p, whose result value becomes the initial accumulator for the rest
function. Then it attempts to parse an operator and a single p. If successful, the
accumulator and the result from p are combined using the function f returned from
parsing the operator, and the resulting value becomes the new accumulator when
parsing the remainder of the sequence (using a recursive call to rest). Otherwise,
the sequence is finished, and the accumulator is returned.
As another interesting application of chainl1, we can redefine our earlier parser
nat for natural numbers such that it does not construct an intermediate list of
digits. In this case, the op parser does not do any parsing, but returns the function
that combines a natural and a digit:
nat :: Parser Int
nat = [ord x - ord ’0’ | x <- digit] ‘chainl1‘ [op]
where
m ‘op‘ n = 10*m + n
Naturally, we can also define a combinator chainr1 that parses non-empty sequences of items separated by operators that associate to the right, rather than to
the left. For simplicity, we only give the direct recursive definition:
chainr1
:: Parser a -> Parser (a -> a -> a) -> Parser a
p ‘chainr1‘ op =
p ‘bind‘ \x ->
[f x y | f <- op, y <- p ‘chainr1‘ op] ++ [x]
That is, p ‘chainr1‘ op first parses a single p. Then it attempts to parse an operator and the rest of the sequence (using a recursive call to chainr1). If successful,

18

Graham Hutton and Erik Meijer

the pair of results from the first p and the rest of the sequence are combined using the function f returned from parsing the operator. Otherwise, the sequence is
finished, and the result from p is returned.
As an example of using chainr1, we extend our parser for arithmetic expressions
to handle exponentiation; this operator has higher precedence than the previous
two operators, and associates to the right:
expr

= term

‘chainl1‘ addop

term

= factor ‘chainr1‘ expop

factor = nat ++ bracket (char ’(’) expr (char ’)’)
addop

= ops [(char ’+’, (+)), (char ’-’, (-))]

expop

= ops [(char ’^’, (^))]

For completeness, we also define combinators chainl and chainr that have the
same behaviour as chainl1 and chainr1, except that they can also consume no
input, in which case a given value v is returned as the result:
chainl :: Parser a -> Parser (a -> a -> a) -> a -> Parser a
chainl p op v = (p ‘chainl1‘ op) ++ [v]
chainr :: Parser a -> Parser (a -> a -> a) -> a -> Parser a
chainr p op v = (p ‘chainr1‘ op) ++ [v]
In summary then, chainl and chainr provide a simple way to build parsers for
expression-like grammars. Using these combinators avoids the need for transformations to remove left-recursion in the grammar, that would otherwise result in
non-termination of the parser. They also avoid the need for left-factorisation of the
grammar, that would otherwise result in unnecessary backtracking; we will return
to this point in the next section.

5 Efficiency of parsers
Using combinators is a simple and flexible method of building parsers. However,
the power of the combinators — in particular, their ability to backtrack and return
multiple results — can lead to parsers with unexpected space and time performance
if one does not take care. In this section we outline some simple techniques that can
be used to improve the efficiency of parsers. Readers interested in further techniques
are referred to R¨jemo’s thesis (1995), which contains a chapter on the use of heap
o
profiling tools in the optimisation of parser combinators.

Monadic Parser Combinators

19

5.1 Left factoring
Consider the simple problem of parsing and evaluating two natural numbers separated by the addition symbol ‘+’, or by the subtraction symbol ‘-’. This specification
can be translated directly into the following parser:
eval :: Parser
eval = add ++
where
add
sub

Int
sub
= [x+y | x <- nat, _ <- char ’+’, y <- nat]
= [x-y | x <- nat, _ <- char ’-’, y <- nat]

This parser gives the correct results, but is inefficient. For example, when parsing
the string "123-456" the number 123 will first be parsed by the add parser, that
will then fail because there is no ‘+’ symbol following the number. The correct parse
will only be found by backtracking in the input string, and parsing the number 123
again, this time from within the sub parser.
Of course, the way to avoid the possibility of backtracking and repeated parsing
is to left factorise the eval parser. That is, the initial use of nat in the component
parsers add and sub should be factorised out:
eval = [v | x <- nat, v <- add x ++ sub x]
where
add x = [x+y | _ <- char ’+’, y <- nat]
sub x = [x+y | _ <- char ’-’, y <- nat]
This new version of eval gives the same results as the original version, but requires
no backtracking. Using the new eval, the string "123-456" can now be parsed in
linear time. In fact we can go a little further, and right factorise the remaining
use of nat in both add and sub. This does not improve the efficiency of eval, but
arguably gives a cleaner parser:
eval = [f x y | x <- nat
, f <- ops [(char ’+’, (+)), (char ’-’, (-))]
, y <- nat]
In practice, most cases where left factorisation of a parser is necessary to improve
efficiency will concern parsers for some kind of expression. In such cases, manually
factorising the parser will not be required, since expression-like parsers can be built
using the chain combinators from the previous section, which already encapsulate
the necessary left factorisation.
The motto of this section is the following: backtracking is a powerful tool, but it
should not be used as a substitute for care in designing parsers.
5.2 Improving laziness
Recall the definition of the repetition combinator many:
many :: Parser a -> Parser [a]
many p = [x:xs | x <- p, xs <- many p] ++ [[]]

20

Graham Hutton and Erik Meijer

For example, applying many (char ’a’) to the input "aaab" gives the result
[("aaa","b"), ("aa","ab"), ("a","aab"),("","aaab")]. Since Gofer is lazy,
we would expect the a’s in the first result "aaa" to become available one at a time,
as they are consumed from the input. This is not in fact what happens. In practice
no part of the result "aaa" will be produced until all the a’s have been consumed.
In other words, many is not as lazy as we would expect.
But does this really matter? Yes, because it is common in functional programming
to rely on laziness to avoid the creation of large intermediate structures (Hughes,
1989). As noted by Wadler (1985; 1992b), what is needed to solve the problem with
many is a means to make explicit that the parser many p always succeeds. (Even
if p itself always fails, many p will still succeed, with the empty list as the result
value.) This is the purpose of the force combinator:
force :: Parser a -> Parser a
force p = \inp -> let x = p inp in
(fst (head x), snd (head x)) : tail x
Given a parser p that always succeeds, the parser force p has the same behaviour
as p, except that before any parsing of the input string is attempted the result of
the parser is immediately forced to take on the form (⊥,⊥):⊥, where ⊥ represents
a presently undefined value.
Using force, the many combinator can be re-defined as follows:
many :: Parser a -> Parser [a]
many p = force ([x:xs | x <- p, xs <- many p] ++ [[]])
The use of force ensures that many p and all of its recursive calls return at least
one result. The new definition of many now has the expected behaviour under lazy
evaluation. For example, applying many (char ’a’) to the partially-defined string
’a’:⊥ gives the partially-defined result (’a’:⊥,⊥):⊥. In contrast, with the old
version of many, the result for this example is the completely undefined value ⊥.
Some readers might wonder why force is defined using the following selection
functions, rather than by pattern matching?
fst :: (a,b) -> a
snd :: (a,b) -> b

head :: [a] -> a
tail :: [a] -> [a]

The answer is that, depending on the semantics of patterns in the particular implementation language, a definition of force using patterns might not have the
expected behaviour under lazy evaluation.
5.3 Limiting the number of results
Consider the simple problem of parsing a natural number, or if no such number is
present just returning the number 0 as the default result. A first approximation to
such a parser might be as follows:
number :: Parser Int
number = nat ++ [0]

Monadic Parser Combinators

21

However, this does not quite have the required behaviour. For example, applying
number to the input "hello" gives the correct result [(0,"hello")]. On the other
hand, applying number to "123" gives the result [(123,""), (0,"123")], whereas
we only really want the single result [(123,"")].
One solution to the above problem is to make use of deterministic parser combinators (see section 7.5) — all parsers built using such combinators are restricted
by construction to producing at most one result. A more general solution, however,
is to retain the flexibility of the non-deterministic combinators, but to provide a
means to make explicit that we are only interested in the first result produced by
certain parsers, such as number. This is the purpose of the first combinator:
first :: Parser a -> Parser a
first p = \inp -> case p inp of
[]
-> []
(x:xs) -> [x]
Given a parser p, the parser first p has the same behaviour as p, except that
only the first result (if any) is returned. Using first we can define a deterministic
version (+++) of the standard choice combinator (++) for parsers:
(+++) :: Parser a -> Parser a -> Parser a
p +++ q = first (p ++ q)
Replacing (++) by (+++) in number gives the desired behaviour.
As well as being used to ensure the correct behaviour of parsers, using (+++) can
also improve their efficiency. As an example, consider a parser that accepts either
of the strings "yellow" or "orange":
colour :: Parser String
colour = p1 ++ p2
where
p1 = string "yellow"
p2 = string "orange"
Recall now the behaviour of the choice combinator (++): it takes a string, applies
both argument parsers to this string, and concatenates the resulting lists. Thus in
the colour example, if p1 is successfully applied then p2 will still be applied to the
same string, even though it is guaranteed to fail. This inefficiency can be avoided
using (+++), which ensures that if p1 succeeds then p2 is never applied:
colour = p1 +++ p2
where
p1 = string "yellow"
p2 = string "orange"
More generally, if we know that a parser of the form p ++ q is deterministic (only
ever returns at most one result value), then p +++ q has the same behaviour, but is
more efficient: if p succeeds then q is never applied. In the remainder of this article
it will mostly be the (+++) choice combinator that is used. For reasons of efficiency,

22

Graham Hutton and Erik Meijer

in the combinator libraries that accompany this article, the repetition combinators
from the previous section are defined using (+++) rather than (++).
We conclude this section by asking why first is defined by pattern matching,
rather than by using the selection function take :: Int -> [a] -> [a] (where,
for example, take 3 "parsing" = "par"):
first p = \inp -> take 1 (p inp)
The answer concerns the behaviour under lazy evaluation. To see the problem, let
us unfold the use of take in the above definition:
first p = \inp -> case p inp of
[]
-> []
(x:xs) -> x : take 0 xs
When the sub-expression take 0 xs is evaluated, it will yield []. However, under
lazy evaluation this computation will be suspended until its value is required. The
effect is that the list xs may be retained in memory for some time, when in fact
it can safely be discarded immediately. This is an example of a space leak . The
definition of first using pattern matching does not suffer from this problem.
6 Handling lexical issues
Traditionally, a string to be parsed is not supplied directly to a parser, but is
first passed through a lexical analysis phase (or lexer) that breaks the string into
a sequence of tokens (Aho et al., 1986). Lexical analysis is a convenient place to
remove white-space (spaces, newlines, and tabs) and comments from the input
string, and to distinguish between identifiers and keywords.
Since lexers are just simple parsers, they can be built using parser combinators,
as discussed by Hutton (1992). However, as we shall see in this section, the need
for a separate lexer can often be avoided (even for substantial grammars such as
that for Gofer), with lexical issues being handled within the main parser by using
some special purpose combinators.
6.1 White-space, comments, and keywords
We begin by defining a parser that consumes white-space from the beginning of a
string, with a dummy value () returned as result:
spaces :: Parser ()
spaces = [() | _ <- many1 (sat isSpace)]
where
isSpace x =
(x == ’ ’) || (x == ’\n’) || (x == ’\t’)
Similarly, a single-line Gofer comment can be consumed as follows:
comment :: Parser ()
comment = [() | _ <- string "--"
, _ <- many (sat (\x -> x /= ’\n’))]

Monadic Parser Combinators

23

We leave it as an exercise for the reader to define a parser for consuming multi-line
Gofer comments {- ... -}, which can be nested.
After consuming white-space, there may still be a comment left to consume from
the input string. Dually, after a comment there may still be white-space. Thus we
are motivated to defined a special parser that repeatedly consumes white-space and
comments until no more remain:
junk :: Parser ()
junk = [() | _ <- many (spaces +++ comment)]
Note that while spaces and comment can fail, the junk parser always succeeds. We
define two combinators in terms of junk: parse removes junk before applying a
given parser, and token removes junk after applying a parser:
parse :: Parser a -> Parser a
parse p = [v | _ <- junk, v <- p]
token :: Parser a -> Parser a
token p = [v | v <- p, _ <- junk]
With the aid of these two combinators, parsers can be modified to ignore whitespace and comments. Firstly, parse is applied once to the parser as a whole, ensuring that input to the parser begins at a significant character. And secondly, token
is applied once to all sub-parsers that consume complete tokens, thus ensuring that
the input always remains at a significant character.
Examples of parsers for complete tokens are nat and int (for natural numbers
and integers), parsers of the form string xs (for symbols and keywords), and
ident (for identifiers). It is useful to define special versions of these parsers — and
more generally, special versions of any user-defined parsers for complete tokens —
that encapsulate the necessary application of token:
natural
natural

:: Parser Int
= token nat

integer
integer

:: Parser Int
= token int

symbol
symbol xs

:: String -> Parser String
= token (string xs)

identifier
:: [String] -> Parser String
identifier ks = token [x | x <- ident, not (elem x ks)]
Note that identifier takes a list of keywords as an argument, where a keyword
is a string that is not permitted as an identifier. For example, in Gofer the strings
“data” and “where” (among others) are keywords. Without the keyword check,
parsers defined in terms of identifier could produce unexpected results, or involve
unnecessary backtracking to construct the correct parse of the input string.

24

Graham Hutton and Erik Meijer
6.2 A parser for λ-expressions

To illustrate the use of the new combinators given above, let us define a parser for
simple λ-expressions extended with a “let” construct for local definitions. Parsed
expressions will be represented in Gofer as follows:
data Expr =
|
|
|

App
Lam
Let
Var

Expr Expr
String Expr
String Expr Expr
String

-----

application
lambda abstraction
local definition
variable

Now a parser expr :: Parser Expr can be defined by:
expr

= atom ‘chainl1‘ [App]

atom

= lam +++ local +++ var +++ paren

lam

= [Lam x e |
,
,
,

local

= [Let x e e’ |
,
,
,
,
,

var

= [Var x | x <- variable]

paren

= bracket (symbol "(") expr (symbol ")")

_
x
_
e

<<<<-

symbol "\\"
variable
symbol "->"
expr]

_
x
_
e
_
e’

<<<<<<-

symbol "let"
variable
symbol "="
expr
symbol "in"
expr]

variable = identifier ["let","in"]
Note how the expr parser handles white-space and comments by using the symbol
parser in place of string and char. Similarly, the keywords “let” and “in” are
handled by using identifier to define the parser for variables. Finally, note how
applications (f e1 e2 ... en) are parsed in the form (((f e1) e2) ... ) by
using the chainl1 combinator.

7 Factorising the parser monad
Up to this point in the article, combinator parsers have been our only example of
the notion of a monad. In this section we define a number of other monads related
to the parser monad, leading up to a modular reformulation of the parser monad
in terms of two simpler monads (Jones, 1995a). The immediate benefit is that, as

Monadic Parser Combinators

25

we shall see, the basic parser combinators no longer need to be defined explicitly.
Rather, they arise automatically as a special case of lifting monad operations from
a base monad m to a certain other monad parameterised over m. This also means
that, if we change the nature of parsers by modifying the base monad (for example,
limiting parsers to producing at most one result), new combinators for the modified
monad of parsers are also defined automatically.
7.1 The exception monad
Before starting to define other monads, it is useful to first focus briefly on the
intuition behind the use of monads in functional programming (Wadler, 1992a).
The basic idea behind monads is to distinguish the values that a computation
can produce from the computation itself. More specifically, given a monad m and
a type a, we can think of m a as the type of computations that yield results of
type a, with the nature of the computation captured by the type constructor m.
The combinators result and bind (with zero and (++) if appropriate) provide a
means to structure the building of such computations:
result
bind
zero
(++)

::
::
::
::

m
m
m
m

a
a -> (a -> m b) -> m b
a
a -> m a -> m a

From a computational point of view, result converts values into computations
that yield those values; bind chains two computations together in sequence, with
results of the first computation being made available for use in the second; zero is
the trivial computation that does nothing; and finally, (++) is some kind of choice
operation for computations.
Consider, for example, the type constructor Maybe:
data Maybe a = Just a | Nothing
We can think of a value of type Maybe a as a computation that either succeeds with
a value of type a, or fails, producing no value. Thus, the type constructor Maybe
captures computations that have the possibility to fail.
Defining the monad combinators for a given type constructor is usually just a
matter of making the “obvious definitions” suggested by the types of the combinators. For example, the type constructor Maybe can be made into a monad with a
zero and plus using the following definitions:
instance Monad Maybe where
-- result
:: a -> Maybe a
result x
= Just x
-- bind
:: Maybe a -> (a -> Maybe b) -> Maybe b
(Just x) ‘bind‘ f = f x
Nothing ‘bind‘ f = Nothing

26

Graham Hutton and Erik Meijer

instance Monad0Plus Maybe where
-- zero
:: Maybe a
zero
= Nothing
-- (++)
Just x ++ y
Nothing ++ y

:: Maybe a -> Maybe a -> Maybe a
= Just x
= y

That is, result converts a value into a computation that succeeds with this value;
bind is a sequencing operator, with a successful result from the first computation
being available for use in the second computation; zero is the computation that
fails; and finally, (++) is a (deterministic) choice operator that returns the first
computation if it succeeds, and the second otherwise.
Since failure can be viewed as a simple kind of exception, Maybe is sometimes
called the exception monad in the literature (Spivey, 1990).
7.2 The non-determinism monad
A natural generalisation of Maybe is the list type constructor []. While a value of
type Maybe a can be thought of as a computation that either succeeds with a single
result of type a or fails, a value of type [a] can be thought of as a computation
that has the possibility to succeed with any number of results of type a, including
zero (which represents failure). Thus the list type constructor [] can be used to
capture non-deterministic computations.
Now [] can be made into a monad with a zero and plus:
instance Monad [] where
-- result
:: a -> [a]
result x
= [x]
-- bind
:: [a] -> (a -> [b]) -> [b]
[]
‘bind‘ f = []
(x:xs) ‘bind‘ f = f x ++ (xs ‘bind‘ f)
instance Monad0Plus [] where
-- zero
:: [a]
zero
= []
-- (++)
[]
++ ys
(x:xs) ++ ys

:: [a] -> [a] -> [a]
= ys
= x : (xs ++ ys)

That is, result converts a value into a computation that succeeds with this single
value; bind is a sequencing operator for non-deterministic computations; zero always fails; and finally, (++) is a (non-deterministic) choice operator that appends
the results of the two argument computations.

Monadic Parser Combinators

27

7.3 The state-transformer monad
Consider the (binary) type constructor State:
type State s a = s -> (a,s)
Values of type State s a can be interpreted as follows: they are computations that
take an initial state of type s, and yield a value of type a together with a new state
of type s. Thus, the type constructor State s obtained by applying State to a
single type s captures computations that involve state of type s. We will refer to
values of type State s a as stateful computations.
Now State s can be made into a monad:
instance Monad (State s) where
-- result :: a -> State s a
result v
= \s -> (v,s)
-- bind
:: State s a -> (a -> State s b) -> State s b
st ‘bind‘ f = \s -> let (v,s’) = st s in f v s’
That is, result converts a value into a stateful computation that returns that value
without modifying the internal state, and bind composes two stateful computations
in sequence, with the result value from the first being supplied as input to the
second. Thinking pictorially in terms of boxes and wires is a useful aid to becoming
familiar with these two operations (Jones & Launchbury, 1994).
The state-transformer monad State s does not have a zero and a plus. However,
as we shall see in the next section, the parameterised state-transformer monad over
a given based monad m does have a zero and a plus, provided that m does.
To allow us to access and modify the internal state, a few extra operations on
the monad State s are introduced. The first operation, update, modifies the state
by applying a given function, and returns the old state as the result value of the
computation. The remaining two operations are defined in terms of update: set
replaces the state with a new state, and returns the old state as the result; fetch
returns the state without modifying it.
update
set
fetch

:: (s -> s) -> State s s
:: s -> State s s
:: State s s

update f = \s -> (s, f s)
set s
= update (\_ -> s)
fetch
= update id
In fact State s is not the only monad for which it makes sense to define these
operations. For this reason we encapsulate the extra operations in a class, so that
the same names can be used for the operations of different monads:
class Monad m => StateMonad m s where
update :: (s -> s) -> m s

28

Graham Hutton and Erik Meijer
set
fetch
set s
fetch

:: s -> m s
:: m s
= update (\_ -> s)
= update id

This declaration can be read as follows: a type constructor m and a type s are
together a member of the class StateMonad if m is a member of the class Monad,
and if m is also equipped with update, set, and fetch operations of the specified
types. Moreover, the fact that set and fetch can be defined in terms of update is
also reflected in the declaration, by means of default definitions.
Now because State s is already a monad, it can be made into a state monad
using the update operation as defined earlier:
instance StateMonad (State s) s where
-- update :: (s -> s) -> State s s
update f
= \s -> (s, f s)
7.4 The parameterised state-transformer monad
Recall now our type of combinator parsers:
type Parser a = String -> [(a,String)]
We see now that parsers combine two kinds of computation: non-deterministic computations (the result of a parser is a list), and stateful computations (the state is the
string being parsed). Abstracting from the specific case of returning a list of results,
the Parser type gives rise to a generalised version of the State type constructor
that applies a given type constructor m to the result of the computation:
type StateM m s a = s -> m (a,s)
Now StateM m s can be made into a monad with a zero and a plus, by inheriting
the monad operations from the base monad m:
instance Monad m => Monad (StateM m s) where
-- result
:: a -> StateM m s a
result v
= \s -> result (v,s)
-- bind
:: StateM m s a ->
-(a -> StateM m s b) -> StateM m s b
stm ‘bind‘ f = \s -> stm s ‘bind‘ \(v,s’) -> f v s’
instance Monad0Plus m => Monad0Plus (StateM m s) where
-- zero
:: StateM m s a
zero
= \s -> zero
-- (++)
:: StateM m s a -> StateM m s a -> StateM m s a
stm ++ stm’ = \s -> stm s ++ stm’ s

Monadic Parser Combinators

29

That is, result converts a value into a computation that returns this value without
modifying the internal state; bind chains two computations together; zero is the
computation that fails regardless of the input state; and finally, (++) is a choice
operation that passes the same input state through to both of the argument computations, and combines their results.
In the previous section we defined the extra operations update, set and fetch
for the monad State s. Of course, these operations can also be defined for the
parameterised state-transformer monad StateM m s. As previously, we only need
to define update, the remaining two operations being defined automatically via
default definitions:
instance Monad m => StateMonad (StateM m s) s where
-- update :: Monad m => (s -> s) -> StateM m s s
update f
= \s -> result (s, f s)

7.5 The parser monad revisited
Recall once again our type of combinator parsers:
type Parser a = String -> [(a,String)]
This type can now be re-expressed using the parameterised state-transformer monad
StateM m s by taking [] for m, and String for s:
type Parser a = StateM [] String a
But why view the Parser type in this way? The answer is that all the basic parser
combinators no longer need to be defined explicitly (except one, the parser item for
single characters), but rather arise as an instance of the general case of extending
monad operations from a type constructor m to the type constructor StateM m s.
More specifically, since [] forms a monad with a zero and a plus, so does State []
String, and hence Gofer automatically provides the following combinators:
result
bind
zero
(++)

::
::
::
::

a -> Parser a
Parser a -> (a -> Parser b) -> Parser b
Parser a
Parser a -> Parser a -> Parser a

Moreover, defining the parser monad in this modular way in terms of StateM
means that, if we change the type of parsers, then new combinators for the modified
type are also defined automatically. For example, consider replacing
type Parser a = StateM [] String a
by a new definition in which the list type constructor [] (which captures nondeterministic computations that can return many results) is replaced by the Maybe
type constructor (which captures deterministic computations that either fail, returning no result, or succeed with a single result):

30

Graham Hutton and Erik Meijer
data Maybe a

= Just a | Nothing

type Parser a = StateM Maybe String a
Since Maybe forms a monad with a zero and a plus, so does the re-defined Parser
type constructor, and hence Gofer automatically provides result, bind, zero, and
(++) combinators for deterministic parsers. In earlier approaches that do not exploit
the monadic nature of parsers (Wadler, 1985; Hutton, 1992; Fokker, 1995), the basic
combinators would have to be re-defined by hand.
The only basic parsing primitive that does not arise from the monadic structure
of the Parser type is the parser item for consuming single characters:
item :: Parser Char
item = \inp -> case inp of
[]
-> []
(x:xs) -> [(x,xs)]
However, item can now be re-defined in monadic style. We first fetch the current
state (the input string); if the string is empty then the item parser fails, otherwise
the first character is consumed (by applying the tail function to the state), and
returned as the result value of the parser:
item

= [x | (x:_) <- update tail]

The advantage of the monadic definition of item is that it does not depend upon
the internal details of the Parser type. Thus, for example, it works equally well for
both the non-deterministic and deterministic versions of Parser.
8 Handling the offside rule
Earlier (section 6) we showed that the need for a lexer to handle white-space,
comments, and keywords can be avoided by using special combinators within the
main parser. Another task usually performed by a lexer is handling the Gofer offside
rule. This rule allows the grouping of definitions in a program to be indicated
using indentation, and is usually implemented by the lexer inserting extra tokens
(concerning indentation) into its output stream.
In this section we show that Gofer’s offside rule can be handled in a simple and
natural manner without a separate lexer, by once again using special combinators.
Our approach was inspired by the monadic view of parsers, and is a development
of an idea described earlier by Hutton (1992).

