doc/monparsing.org
** 1 The offside rule
Consider the following simple Gofer program:
a = b + c
where
b = 10

Monadic Parser Combinators

31

c = 15 - 5
d = a * 2
It is clear from the use of indentation that a and d are intended to be global
definitions, with b and c local definitions to a. Indeed, the above program can be
viewed as a shorthand for the following program, in which the grouping of definitions
is made explicit using special brackets and separators:
{ a = b + c
where
{ b = 10
; c = 15 - 5 }
; d = a * 2 }
How the grouping of Gofer definitions follows from their indentation is formally
specified by the offside rule. The essence of the rule is as follows: consecutive definitions that begin in the same column c are deemed to be part of the same group.
To make parsing easier, it is further required that the remainder of the text of each
definition (excluding white-space and comments, of course) in a group must occur
in a column strictly greater than c. In terms of the offside rule then, definitions a
and d in the example program above are formally grouped together (and similarly
for b and c) because they start in the same column as one another.
** 2 Modifying the type of parsers
To implement the offside rule, we will have to maintain some extra information
during parsing. First of all, since column numbers play a crucial role in the offside
rule, parsers will need to know the column number of the first character in their
input string. In fact, it turns out that parsers will also require the current line
number. Thus our present type of combinator parsers,
type Parser a = StateM [] String a
is revised to the following type, in which the internal state of a parser now contains
a (line,column) position in addition to a string:
type Parser a = StateM [] Pstring a
type Pstring

= (Pos,String)

type Pos

= (Int,Int)

In addition, parsers will need to know the starting position of the current definition being parsed — if the offside rule is not in effect, this definition position can
be set with a negative column number. Thus our type of parsers is revised once
more, to take the current definition position as an extra argument:
type Parser a = Pos -> StateM [] Pstring a

32

Graham Hutton and Erik Meijer

Another option would have been to maintain the definition position in the parser
state, along with the current position and the string to be parsed. However, definition positions can be nested, and supplying the position as an extra argument to
parsers — as opposed to within the parser state — is more natural from the point
of view of implementing nesting of positions.
Is the revised Parser type still a monad? Abstracting from the details, the body
of the Parser type definition is of the form s -> m a (in our case s is Pos, m is the
monad StateM [] Pstring, and a is the parameter type a.) We recognise this as
being similar to the type s -> m (a,s) of parameterised state-transformers, the
difference being that the type s of states no longer occurs in the type of the result:
in other words, the state can be read, but not modified. Thus we can think of s ->
m a as the type of parameterised state-readers. The monadic nature of this type is
the topic of the next section.
** 3 The parameterised state-reader monad
Consider the type constructor ReaderM, defined as follows:
type ReaderM m s a = s -> m a
In a similar way to StateM m s, ReaderM m s can be made into a monad with a
zero and a plus, by inheriting the monad operations from the base monad m:
instance Monad m => Monad (ReaderM m s) where
-- result
:: a -> ReaderM m s a
result v
= \s -> result v
-- bind
:: ReaderM m s a ->
-(a -> ReaderM m s b) -> ReaderM m s b
srm ‘bind‘ f = \s -> srm s ‘bind‘ \v -> f v s
instance Monad0Plus m => Monad0Plus (ReaderM m s) where
-- zero
:: ReaderM m s a
zero
= \s -> zero
-- (++)
:: ReaderM m s a ->
-ReaderM m s a -> ReaderM m s a
srm ++ srm’ = \s -> srm s ++ srm’ s
That is, result converts a value into a computation that returns this value without
consulting the state; bind chains two computations together, with the same state
being passed to both computations (contrast with the bind operation for StateM,
in which the second computation receives the new state produced by the first computation); zero is the computation that fails; and finally, (++) is a choice operation
that passes the same state to both of the argument computations.
To allow us to access and set the state, a couple of extra operations on the
parameterised state-reader monad ReaderM m s are introduced. As for StateM, we

Monadic Parser Combinators

33

encapsulate the extra operations in a class. The operation env returns the state as
the result of the computation, while setenv replaces the current state for a given
computation with a new state:
class Monad m => ReaderMonad m s where
env
:: m s
setenv :: s -> m a -> m a
instance Monad m => ReaderMonad (ReaderM m s) s where
-- env
:: Monad m => ReaderM m s s
env
= \s -> result s
-- setenv
:: Monad m => s ->
-ReaderM m s a -> ReaderM m s a
setenv s srm = \_ -> srm s
The name env comes from the fact that one can think of the state supplied to a
state-reader as being a kind of env ironment. Indeed, in the literature state-reader
monads are sometimes called environment monads.
