doc/monparsing.html
during parsing. First of all, since column numbers play a crucial role in the offside
rule, parsers will need to know the column number of the first character in their
input string. In fact, it turns out that parsers will also require the current line
number. Thus our present type of combinator parsers,
type Parser a = StateM [] String a
is revised to the following type, in which the internal state of a parser now contains
a (line,column) position in addition to a string:
type Parser a = StateM [] Pstring a
type Pstring
</p>
<p>
= (Pos,String)
</p>
<p>
type Pos
</p>
<p>
= (Int,Int)
</p>
<p>
In addition, parsers will need to know the starting position of the current definition being parsed — if the offside rule is not in effect, this definition position can
be set with a negative column number. Thus our type of parsers is revised once
more, to take the current definition position as an extra argument:
type Parser a = Pos -&gt; StateM [] Pstring a
</p>
<p>
32
</p>
<p>
Graham Hutton and Erik Meijer
</p>
<p>
Another option would have been to maintain the definition position in the parser
state, along with the current position and the string to be parsed. However, definition positions can be nested, and supplying the position as an extra argument to
parsers — as opposed to within the parser state — is more natural from the point
of view of implementing nesting of positions.
Is the revised Parser type still a monad? Abstracting from the details, the body
of the Parser type definition is of the form s -&gt; m a (in our case s is Pos, m is the
monad StateM [] Pstring, and a is the parameter type a.) We recognise this as
being similar to the type s -&gt; m (a,s) of parameterised state-transformers, the
difference being that the type s of states no longer occurs in the type of the result:
in other words, the state can be read, but not modified. Thus we can think of s -&gt;
m a as the type of parameterised state-readers. The monadic nature of this type is
the topic of the next section.
8.3 The parameterised state-reader monad
Consider the type constructor ReaderM, defined as follows:
type ReaderM m s a = s -&gt; m a
In a similar way to StateM m s, ReaderM m s can be made into a monad with a
zero and a plus, by inheriting the monad operations from the base monad m:
instance Monad m =&gt; Monad (ReaderM m s) where
&ndash; result
:: a -&gt; ReaderM m s a
result v
= \s -&gt; result v
&ndash; bind
:: ReaderM m s a -&gt;
-(a -&gt; ReaderM m s b) -&gt; ReaderM m s b
srm ‘bind‘ f = \s -&gt; srm s ‘bind‘ \v -&gt; f v s
instance Monad0Plus m =&gt; Monad0Plus (ReaderM m s) where
&ndash; zero
:: ReaderM m s a
zero
= \s -&gt; zero
&ndash; (++)
:: ReaderM m s a -&gt;
-ReaderM m s a -&gt; ReaderM m s a
srm ++ srm’ = \s -&gt; srm s ++ srm’ s
That is, result converts a value into a computation that returns this value without
consulting the state; bind chains two computations together, with the same state
being passed to both computations (contrast with the bind operation for StateM,
in which the second computation receives the new state produced by the first computation); zero is the computation that fails; and finally, (++) is a choice operation
that passes the same state to both of the argument computations.
To allow us to access and set the state, a couple of extra operations on the
parameterised state-reader monad ReaderM m s are introduced. As for StateM, we
</p>
<p>
Monadic Parser Combinators
</p>
<p>
33
</p>
<p>
encapsulate the extra operations in a class. The operation env returns the state as
the result of the computation, while setenv replaces the current state for a given
computation with a new state:
class Monad m =&gt; ReaderMonad m s where
env
:: m s
setenv :: s -&gt; m a -&gt; m a
instance Monad m =&gt; ReaderMonad (ReaderM m s) s where
&ndash; env
:: Monad m =&gt; ReaderM m s s
env
= \s -&gt; result s
&ndash; setenv
:: Monad m =&gt; s -&gt;
-ReaderM m s a -&gt; ReaderM m s a
setenv s srm = _ -&gt; srm s
The name env comes from the fact that one can think of the state supplied to a
state-reader as being a kind of env ironment. Indeed, in the literature state-reader
monads are sometimes called environment monads.
8.4 The new parser combinators
Using the ReaderM type constructor, our revised type of parsers
type Parser a = Pos -&gt; StateM [] Pstring a
can now be expressed as follows:
type Parser a = ReaderM (StateM [] Pstring) Pos a
Now since [] forms a monad with a zero and a plus, so does StateM [] Pstring,
and hence so does ReaderM (StateM [] Pstring) Pos. Thus Gofer automatically
provides result, bind, zero, and (++) operations for parsers that can handle the
