doc/monparsing.html
offside rule. Since the type of parsers is now defined in terms of ReaderM at the top
level, the extra operations env and setenv are also provided for parsers. Moreover,
the extra operation update (and the derived operations set and fetch) from the
underlying state monad can be lifted to the new type of parsers — or more generally,
to any parameterised state-reader monad — by ignoring the environment:
instance StateMonad m a =&gt; StateMonad (ReaderM m s) a where
&ndash; update :: StateMonad m a =&gt; (a -&gt; a) -&gt; ReaderM m s a
update f
= _ -&gt; update f
Now that the internal state of parsers has been modified (from String to Pstring),
the parser item for consuming single characters from the input must also be modified. The new definition for item is similar to the old,
item :: Parser Char
item = [x | (x:_) &lt;- update tail]
</p>
<p>
34
</p>
<p>
Graham Hutton and Erik Meijer
</p>
<p>
except that the item parser now fails if the position of the character to be consumed
is not onside with respect to current definition position:
item :: Parser Char
item = [x | (pos,x:_) &lt;- update newstate
, defpos
&lt;- env
, onside pos defpos]
A position is onside if its column number is strictly greater than the current definition column. However, the first character of a new definition begins in the same
column as the definition column, so this is handled as a special case:
onside
:: Pos -&gt; Pos -&gt; Bool
onside (l,c) (dl,dc) = (c &gt; dc) || (l == dl)
The remaining auxiliary function, newstate, consumes the first character from the
input string, and updates the current position accordingly (for example, if a newline
character was consumed, the current line number is incremented, and the current
column number is set back to zero):
newstate :: Pstring -&gt; Pstring
newstate ((l,c),x:xs)
= (newpos,xs)
where
newpos = case x of
’\n’ -&gt; (l+1,0)
’\t’ -&gt; (l,((c ‘div‘ 8)+1)*8)
_
-&gt; (l,c+1)
One aspect of the offside rule still remains to be addressed: for the purposes
of this rule, white-space and comments are not significant, and should always be
successfully consumed even if they contain characters that are not onside. This can
be handled by temporarily setting the definition position to (0, −1) within the junk
parser for white-space and comments:
junk :: Parser ()
junk = [() | _ &lt;- setenv (0,-1) (many (spaces +++ comment))]
All that remains now is to define a combinator that parses a sequence of definitions subject to the Gofer offside rule:
many1<sub>offside</sub> :: Parser a -&gt; Parser [a]
many1<sub>offside</sub> p = [vs | (pos,_) &lt;- fetch
, vs
&lt;- setenv pos (many1 (off p))]
That is, many1 offside p behaves just as many1 (off p), except that within this
parser the definition position is set to the current position. (There is no need to
skip white-space and comments before setting the position, since this will already
have been effected by proper use of the lexical combinators token and parse.) The
auxiliary combinator off takes care of setting the definition position locally for
</p>
<p>
Monadic Parser Combinators
</p>
<p>
35
</p>
<p>
each new definition in the sequence, where a new definition begins if the column
position equals the definition column position:
off :: Parser a -&gt; Parser a
off p = [v | (dl,dc)
&lt;- env
, ((l,c),_) &lt;- fetch
, c == dc
, v
&lt;- setenv (l,dc) p]
For completeness, we also define a combinator many offside that has the same
behaviour as the combinator many1 offside, except that it can also parse an empty
sequence of definitions:
many<sub>offside</sub> :: Parser a -&gt; Parser [a]
many<sub>offside</sub> p = many1<sub>offside</sub> p +++ [[]]
To illustrate the use of the new combinators defined above, let us modify our
parser for λ-expressions (section 6.2) so that the “let” construct permits nonempty sequences of local definitions subject to the offside rule. The datatype Expr of
expressions is first modified so that the Let constructor has type [(String,Expr)]
-&gt; Expr instead of String -&gt; Expr -&gt; Expr:
data Expr = &hellip;
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Let [(String,Expr)] Expr</td></tr>
<tr><td class="left">&hellip;</td></tr>
</tbody>
</table>

The only part of the parser that needs to be modified is the parser local for local
definitions, which now accepts sequences:
local = [Let ds e |
,
,
,
defn

<p>
_
ds
_
e
</p>
<p>
&lt;&lt;&lt;&lt;-
</p>
<p>
symbol "let"
many1<sub>offside</sub> defn
symbol "in"
expr]
</p>
<p>
= [(x,e) | x &lt;- identifier
, _ &lt;- symbol "="
, e &lt;- expr]
</p>
<p>
We conclude this section by noting that the use of the offside rule when laying out
sequences of Gofer definitions is not mandatory. As shown in our initial example, one
also has the option to include explicit layout information in the form of parentheses
“{” and “}” around the sequence, with definitions separated by semi-colons “;”.
We leave it as an exercise to the reader to use many offside to define a combinator
that implements this convention.
In summary then, to permit combinator parsers to handle the Gofer offside rule,
we changed the type of parsers to include some positional information, modified
the item and junk combinators accordingly, and defined two new combinators:
many1 offside and many offside. All other necessary redefining of combinators
is done automatically by the Gofer type system.
</p>
<p>
36
</p>
<p>
Graham Hutton and Erik Meijer
9 Acknowledgements
</p>
<p>
The first author was employed by the University of Utrecht during part of the
writing of this article, for which funding is gratefully acknowledged.
Special thanks are due to Luc Duponcheel for many improvements to the implementation of the combinator libraries in Gofer (particularly concerning the use
of type classes and restricted type synonyms), and to Mark P. Jones for detailed
comments on the final draft of this article.
10 Appendix: a parser for data definitions
To illustrate the monadic parser combinators developed in this article in a real-life
setting, we consider the problem of parsing a sequence of Gofer datatype definitions.
An example of such a sequence is as follows:
data List a = Nil | Cons a (List a)
data Tree a b = Leaf a
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Node (Tree a b, b, Tree a b)</td></tr>
</tbody>
</table>

Within the parser, datatypes will be represented as follows:
type Data = (String,
[String],
[(String,[Type])])

<p>
&ndash; type name
&ndash; parameters
&ndash; constructors and arguments
</p>
<p>
The representation Type for types will be treated shortly. A parser datadecls ::
Parser [Data] for a sequence of datatypes can now be defined by
datadecls
</p>
<p>
= many<sub>offside</sub> datadecl
</p>
<p>
datadecl
</p>
<p>
= [(x,xs,b) |
,
,
,
,
</p>
<p>
_
x
xs
_
b
</p>
<p>
&lt;&lt;&lt;&lt;&lt;-
</p>
<p>
symbol "data"
constructor
many variable
symbol "="
condecl ‘sepby1‘ symbol "|"]
</p>
<p>
constructor = token [(x:xs) | x &lt;- upper
, xs &lt;- many alphanum]
variable
</p>
<p>
= identifier ["data"]
</p>
<p>
condecl
</p>
<p>
= [(x,ts) | x &lt;- constructor
, ts &lt;- many type2]
</p>
<p>
There are a couple of points worth noting about this parser. Firstly, all lexical
issues (white-space and comments, the offside rule, and keywords) are handled by
combinators. And secondly, since constructor is a parser for a complete token, the
token combinator is applied within its definition.
</p>
<p>
Monadic Parser Combinators
</p>
<p>
37
</p>
<p>
Within the parser, types will be represented as follows:
data Type
</p>
<p>
=
</p>
<p>
Arrow Type Type
Apply Type Type
Var String
Con String
Tuple [Type]
List Type
</p>

<hr/>

<p>
function
application
variable
constructor
tuple
list
</p>
<p>
A parser type0 :: Parser Type for types can now be defined by
type0
type1
type2
</p>
<p>
= type1 ‘chainr1‘ [Arrow | _ &lt;- symbol "-&gt;"]
= type2 ‘chainl1‘ [Apply]
= var +++ con +++ list +++ tuple
</p>
<p>
var
</p>
<p>
= [Var x | x &lt;- variable]
</p>
<p>
con
</p>
<p>
= [Con x | x &lt;- constructor]
</p>
<p>
list
</p>
<p>
= [List x | x &lt;- bracket
(symbol "[")
type0
(symbol "]")]
</p>
<p>
tuple
</p>
<p>
= [f ts | ts &lt;- bracket
(symbol "(")
(type0 ‘sepby‘ symbol ",")
(symbol ")")]
where f [t] = t
f ts = Tuple ts
</p>
<p>
Note how chainr1 and chainl1 are used to handle parsing of function-types and
application. Note also that (as in Gofer) building a singleton tuple (t) of a type t
is not possible, since (t) is treated as a parenthesised expression.
References
Aho, A., Sethi, R., &amp; Ullman, J. (1986). Compilers — principles, techniques and tools.
Addison-Wesley.
Burge, W.H. (1975). Recursive programming techniques. Addison-Wesley.
Fokker, Jeroen. 1995 (May). Functional parsers. Lecture notes of the Baastad Spring
school on functional programming.
Gill, Andy, &amp; Marlow, Simon. 1995 (Jan.). Happy: the parser generator for Haskell.
University of Glasgow.
Hughes, John. (1989). Why functional programming matters. The computer journal,
32(2), 98–107.
Hutton, Graham. (1992). Higher-order functions for parsing. Journal of functional programming, 2(3), 323–343.
</p>
<p>
38
</p>
<p>
Graham Hutton and Erik Meijer
</p>
<p>
Jones, Mark P. (1994). Gofer 2.30a release notes. Unpublished manuscript.
Jones, Mark P. (1995a). Functional programming beyond the Hindley/Milner type system.
Proc. lecture notes of the Baastad spring school on functional programming.
Jones, Mark P. (1995b). The Gofer distribution. Available from the University of Nottingham: <a href="http://www.cs.nott.ac.uk/Department/Staff/mpj/">http://www.cs.nott.ac.uk/Department/Staff/mpj/</a>.
Jones, Mark P. (1995c). A system of constructor classes: overloading and implicit higherorder polymorphism. Journal of functional programming, 5(1), 1–35.
Jones, Simon Peyton, &amp; Launchbury, John. (1994). State in Haskell. University of Glasgow.
Landin, Peter. (1966). The next 700 programming languages. Communications of the
ACM, 9(3).
Mogensen, Torben. (1993). Ratatosk: a parser generator and scanner generator for Gofer.
University of Copenhagen (DIKU).
Moggi, Eugenio. (1989). Computation lambda-calculus and monads. Proc. IEEE symposium on logic in computer science. A extended version of the paper is available as a
technical report from the University of Edinburgh.
R¨jemo, Niklas. (1995). Garbage collection and memory efficiency in lazy functional lano
guages. Ph.D. thesis, Chalmers University of Technology.
Spivey, Mike. (1990). A functional theory of exceptions. Science of computer programming,
14, 25–42.
Wadler, Philip. (1985). How to replace failure by a list of successes. Proc. conference on
functional programming and computer architecture. Springer–Verlag.
Wadler, Philip. (1990). Comprehending monads. Proc. ACM conference on Lisp and
functional programming.
Wadler, Philip. (1992a). The essence of functional programming. Proc. principles of
programming languages.
Wadler, Philip. (1992b). Monads for functional programming. Broy, Manfred (ed), Proc.
Marktoberdorf Summer school on program design calculi. Springer–Verlag.
</p>
<p>

</p>
</div>
</div>

</div>
