doc/monparsing.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><a name="ID-2493d7e0-cb01-4dbb-a359-ab9345af6180" id="ID-2493d7e0-cb01-4dbb-a359-ab9345af6180"></a><span class="section-number-2">7</span> Common Lisp APPENDix</h2>
<div class="outline-text-2" id="text-7">



</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> DEFINE-INTERFACE</h3>
<div class="outline-text-3" id="text-7-1">





<pre class="example">(eval-when (:compile-toplevel :load-toplevel :execute)
  (defgeneric interface-options (&lt;interface&gt;)
   (:method-combination append))

  (defgeneric expand-interface-option (&lt;interface&gt; option-name 
                                       &amp;rest
                                         option-args)
    (:method (&lt;interface&gt; option-name &amp;rest option-args)
      (declare (ignore option-args)) nil)
    (:method (interface-name (option-name (eql :singleton)) &amp;rest option-args)
      (declare (ignore option-args))
      `(defvar ,interface-name
         (make-instance ',interface-name)))
    (:method (&lt;interface&gt; (option-name (eql :generic)) &amp;rest option-args)
      (destructuring-bind (n args . rest) option-args
        `(defgeneric ,n ,args ,@rest))))

  (defgeneric check-interface-option (&lt;interface&gt; 
                                      option-name &amp;rest option-args)
    (:method (&lt;interface&gt; option-name &amp;rest option-args)
      (declare (ignore &lt;interface&gt; option-name option-args)) 
      t)
    (:method (&lt;interface&gt;
              (option-name (eql :generic)) 
              &amp;rest option-args)
      (c2mop:compute-applicable-methods-using-classes 
       (fdefinition (first option-args))
       (list (class-of &lt;interface&gt;)))))


  (defmacro define-interface (name direct-superinterfaces direct-slots
                              &amp;rest options)
    `(cl:eval-when (:compile-toplevel :load-toplevel :execute)
       (defclass ,name ,direct-superinterfaces ,direct-slots)
       ,@(loop :for (oname . args)  :in options
            :collect (apply #'expand-interface-option name oname args))
       (defmethod interface-options append ((&lt;i&gt; ,name))
                  '(,@options)))))

(define-interface &lt;interface&gt; ()
  ())

(defgeneric expand-interface-flet (&lt;interface&gt; body 
                                   &amp;key package symbol-name
                                     &amp;allow-other-keys)
  (:method ((&lt;i&gt; symbol) body &amp;rest args &amp;key &amp;allow-other-keys)
    (apply #'expand-interface-flet (symbol-value &lt;i&gt;) body args))
  (:method ((&lt;i&gt; &lt;interface&gt;) body &amp;key package (symbol-name #'symbol-name)
                                        interface-name
                          &amp;allow-other-keys)
    (let ((interface-name (or interface-name 
                              (class-name (class-of &lt;i&gt;)))))
      `(flet (,@(loop :for (name . args) 
                   :in (interface-options &lt;i&gt;)
                   :when (eq name :generic)
                   :collect (let* ((gf-name (first args))
                                   (gf-package (symbol-package gf-name))
                                   (f-package (or package gf-package))
                                   (f-name (intern (funcall symbol-name gf-name) 
                                                   f-package)))
                              `(,f-name (&amp;rest args)
                                        (apply ',gf-name ,interface-name args)))))
         ,@body))))


(defmacro with-interface ((interface &amp;rest args)
                          &amp;body body)
  (apply #'expand-interface-flet interface body args))



(defun check-interface-type (&lt;interface&gt;)
  (loop :for option :in (interface-options &lt;interface&gt;)
     :unless (apply #'check-interface-option &lt;interface&gt; option)
     :do (return nil)
     :finally (return t)))

(deftype interface ()
  `(satisfies check-interface-type))



;; (macroexpand-1 '(define-interface &lt;interface&gt; ()
;;               ()
;;               (:generic interface-options (&lt;interface&gt;)
;;                (:method-combination append))))
;; =&gt;
;; (PROGN
;;  (DEFCLASS &lt;INTERFACE&gt; NIL NIL)
;;  (DEFGENERIC INTERFACE-OPTIONS
;;      (&lt;INTERFACE&gt;)
;;    (:METHOD-COMBINATION APPEND))
;;  (DEFMETHOD INTERFACE-OPTIONS APPEND ((&lt;I&gt; &lt;INTERFACE&gt;))
;;    '((:GENERIC INTERFACE-OPTIONS (&lt;INTERFACE&gt;) 
;;        (:METHOD-COMBINATION APPEND)))))


</pre>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><a name="ID-26c8228d-c02e-4fcb-8f7b-0a5c1c2c1c0a" id="ID-26c8228d-c02e-4fcb-8f7b-0a5c1c2c1c0a"></a><span class="section-number-3">7.2</span> Pure Interface</h3>
<div class="outline-text-3" id="text-7-2">




<pre class="example">(defpackage :smug/pure/interface
    (:use :cl)
    (:export  #:&lt;interface&gt; 
              #:define-interface
              #:with-interface))

(in-package :smug/pure/interface)

&lt;&lt;lisp-define-interface&gt;&gt;
</pre>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><a name="ID-057214af-daab-4cce-a349-8a0651f3a7ac" id="ID-057214af-daab-4cce-a349-8a0651f3a7ac"></a><span class="section-number-3">7.3</span> Pure Monad</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="example">(defpackage :smug/pure/monad
  (:use :cl)
  (:import-from :smug/pure/interface
                #:define-interface
                #:&lt;interface&gt;
                #:with-interface)
  (:export
   #:&lt;monad&gt;
   #:result
   #:bind
   #:mlet*

   #:&lt;zero-plus&gt;
   #:zero
   #:plus 

   #:&lt;monad-zero-plus&gt;
   #:guard))
(in-package :smug/pure/monad)

&lt;&lt;lisp-monad-interface&gt;&gt;

&lt;&lt;lisp-mlet*&gt;&gt;

&lt;&lt;lisp-zero-plus-interface&gt;&gt;

&lt;&lt;lisp-monad-zero-plus-guard&gt;&gt;
</pre>

</div>

</div>
